[
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "SCANNER ABDOMINOPELVIEN\n\nIndication : Suspicion de sigmoïdite diverticulaire chez un patient de 54 ans présentant des douleurs en fosse iliaque gauche depuis 3j avec fièvre à 38.5°.\nProtocole : Hélices abdominopelviennes sans injection puis après injection de produit de contraste iodé au temps veineux.\nRésultats : Pas d’examen antérieur disponible pour comparaison.\nEpaississement circonférentiel de la charnière rectosigmoïdienne étendu sur environ 6cm, centré sur un diverticule sigmoïdien.\nPrésence d’une hypodensité de 4x6mm dans la paroi du colon sigmoïde, correspondant à un petit abcès.\nPas de pneumopéritoine.\nPas d’occlusion.\nPas d’adénomégalie abdominopelvienne.\nPas d’épanchement abdominopelvien.\nFoie de taille et de morphologie normales, sans lésion focale d’allure suspecte.\nPerméabilité du tronc porte et de ses branches de division proximales.\nPas de dilatation des voies biliaires intra ou extra hépatiques.\nVésicule à parois fines.\nPrésence d’un macrocalcul vésiculaire, sans signe de complication.\nPas de splénomégalie. Nodule de rate accessoire en hypochondre gauche.\nIntégrité morphologique du pancréas, des reins et des surrénales.\nConclusion : Examen compatible avec une sigmoïdite diverticulaire avec abcès pariétal sous-centimétrique, sans perforation.",
    "English translation": "ABDOMINOPELVIC CT SCAN\n\nCLINICAL HISTORY: Suspicion of diverticular sigmoiditis in a 54-year-old patient experiencing left iliac fossa pain for 3 days with a fever of 38.5°C.\nProtocol: Abdominopelvic helical scans without injection followed by post-contrast iodine injection at venous phase.\nResults: No prior examination available for comparison.\nCircumferential thickening of the rectosigmoid junction extending over approximately 6cm, centered on a sigmoid diverticulum.\nPresence of a 4x6mm hypodensity in the wall of the sigmoid colon, corresponding to a small abscess.\nNo pneumoperitoneum.\nNo obstruction.\nNo abdominopelvic lymphadenopathy.\nNo abdominopelvic effusion.\nLiver of normal size and morphology, without suspicious focal lesions.\nPermeability of the portal trunk and its proximal division branches.\nNo dilation of intra or extrahepatic bile ducts.\nGallbladder with thin walls.\nPresence of a large gallbladder gallstone, without signs of complication.\nNo splenomegaly. Accessory spleen nodule in the left hypochondrium.\nMorphological integrity of the pancreas, kidneys, and adrenal glands.\nIMPRESSION: Examination compatible with diverticular sigmoiditis with sub-centimeter parietal abscess, without perforation.",
    "ICD-10 codes": "r50.9,R10.32,k57.20,k80.20"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Brain",
    "Report": "IRM CEREBRALE\n\n\nINDICATION :\nBilan de céphalées brutales il y a une 3j, persistantes. \n\n\nPROTOCOLE :\nSéquences axiales Diffusion, Swi, 3D Flair, ASL, 3D T1 SE. Séquence 3D T1 SE après injection de gadolinium reconstruite dans les 3 plans. \n\nRESULTATS :\n\nPas de lésion ischémique ou hémorragique récente.\nPas d'anomalie de signal ou de morphologie du parenchyme en sus ou sous-tentoriel.\nRespect du système ventriculaire.\nÉléments médians en place. Pas d'engagement.\nPas d’hyperperfusion décelée sur la séquence ASL.\nPerméabilité des artères du polygone de Willis sans sténose ou image d'addition.\n\n\nAbsence de rehaussement pathologique parenchymateuse, méningée ou des nerfs crâniens.\n\n\nFormation kystique extra-axiale arrondie bien limitée de la région temporopolaire droite en hyposignal T1, franc hypersignal T2, sans rehaussement après injection, mesuré à 17 x 24 mm dans le plan axial.\nEffet de masse modéré sur le parenchyme adjacent, sans anomalie de signal.\n\n\nCONCLUSION :\nPas de saignement récent.\nPas de sténose des artères du polygone de Willis. \nKyste arachnoïdien temporo-polaire droit de 17x24mm.",
    "English translation": "BRAIN MRI\n\nCLINICAL HISTORY:\nAssessment of sudden, persistent headaches occurring 3 days ago.\n\nPROTOCOL:\nAxial sequences Diffusion, SWI, 3D FLAIR, ASL, 3D T1 SE. 3D T1 SE sequence after gadolinium injection reconstructed in all three planes.\n\nRESULTS:\n\nNo recent ischemic or hemorrhagic lesions.\nNo signal or morphology anomalies in the supra or infratentorial parenchyma.\nIntact ventricular system.\nMedian structures in place. No herniation.\nNo hyperperfusion detected on the ASL sequence.\nPermeability of the arteries of the Circle of Willis without stenosis or additional imaging findings.\n\nNo pathological enhancement of the parenchyma, meninges, or cranial nerves.\n\nWell-circumscribed extra-axial round cystic formation in the right temporopolar region in T1 hypo signal, marked T2 hyper signal, no enhancement after injection, measuring 17 x 24 mm in the axial plane.\nModerate mass effect on the adjacent parenchyma, with no signal abnormalities.\n\nIMPRESSION:\nNo recent bleeding.\nNo stenosis of the arteries of the Circle of Willis.\nRight temporopolar arachnoid cyst measuring 17x24mm.",
    "ICD-10 codes": "G44.53,G93.0"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Brain",
    "Report": "IRM CEREBRALE\nINDICATION Suspicion d'AVC chez un patient de 43 ans présentant une hypoesthésie de l'hémi face gauche depuis 3 jours avec hypoesthésie de la langue gauche et légère chute de la commissure labiale toujours à gauche. Suspicion de lésion ischémique. \nPROTOCOLE Séquences Axiales FLAIR, SWI et Diffusion avec reconstruction Cartographie ADC. Séquence 3D TOF sur le polygone de Willis.\nRESULTAT Absence de lésion ischémique ou hémorragique récente. Absence d'anomalie de signal ou de morphologie du parenchyme cérébral.Intégrité des espaces liquidiens intra et péricérébraux.Structures médianes en place.\nPerméabilité des artères du polygone de Willis sans image d'addition ou de sténose.\nCONCLUSION Pas d'arguments pour une lésion hémorragique ou ischémique récente.Absence d’occlusion artérielle sur le polygone de Willis",
    "English translation": "BRAIN MRI\nCLINICAL HISTORY: 43 y/o male with hypoesthesia of the left hemiface for 3 days with left tongue hypoesthesia and slight drooping of the left labial commissure. // suspicion of stroke in a patient presenting\nPROTOCOL: Axial FLAIR, SWI, and Diffusion sequences with ADC mapping reconstruction. 3D TOF sequence on the circle of Willis.\nRESULTS: No recent ischemic or hemorrhagic lesion. No signal or morphology abnormalities of the cerebral parenchyma. Integrity of the intra and pericerebral fluid spaces. Median structures in place.\nPermeability of the arteries of the circle of Willis without any additional imaging or stenosis.\nIMPRESSION: No evidence of recent hemorrhagic or ischemic lesions. No arterial occlusion on the circle of Willis.",
    "ICD-10 codes": "R201"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Abdomen",
    "Report": "IRM HÉPATIQUE\n \nINDICATION :\nSuivi de vraisemblable NASH sans fibrose en mesure non-invasive mais avec dysmorphie hépatique marquée. Dépistage de CHC et quantification de la stéatose.\n \nPROTOCOLE :\nSéquences axiale et coronale T2, axiale diffusion, axial T1 Dixon sans et avec injection de gadolinium\n \nRESULTAT :\nHépatomégalie stéatosique (flèche hépatique droite de 23 cm), modérément dysmorphique. Contours lisses. Perméabilité des vaisseaux afférents et efférents hépatiques. Pas de lésion focale hépatique visible.\nPas de dilatation des voies biliaires. Antécédent de cholécystectomie.\nSplénomégalie de 15 cm. Pas de voie de dérivation porto-systémique. Pas d'ascite.\nPoursuite de la diminution de la lésion pancréatique caudale inférieure, de 18 vs 25 mm, compatible avec l'évolution du pseudo-kyste.\nPas d'autre lésion pancréatique focale. Canal pancréatique principal fin.\nPas d'adénomégalie à l'étage-abdominal. Surrénales fines\n \nCONCLUSION :\nhépatomégalie stéatosique sans lésion focale suspecte.",
    "English translation": "MRI of the Liver\n\nCLINICAL HISTORY:\nFollow-up of likely NASH without fibrosis using non-invasive measures but with marked hepatic dysmorphia. Screening for HCC and quantification of steatosis.\n\nProtocol:\nAxial and coronal T2 sequences, axial diffusion, axial T1 Dixon without and with gadolinium injection.\n\nResults:\nSteatotic hepatomegaly (right liver span of 23 cm), moderately dysmorphic. Smooth contours. Permeability of the hepatic afferent and efferent vessels. No visible focal liver lesion.\nNo dilation of the bile ducts. History of cholecystectomy.\nSplenomegaly of 15 cm. No portosystemic shunt pathway. No ascites.\nContinued reduction in size of the lower caudal pancreatic lesion, from 18 mm to 25 mm, consistent with the evolution of a pseudocyst.\nNo other focal pancreatic lesions. Main pancreatic duct is slender.\nNo abdominal lymphadenopathy. Slender adrenal glands.\n\nIMPRESSION:\nSteatotic hepatomegaly without suspicious focal lesions.",
    "ICD-10 codes": "K75.81,R16.2,Z90.49,K86.3"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Abdomen",
    "Report": "INDICATION :\nPatiente suivie depuis décembre 2014 pour carcinose péritonéale d'origine ovarienne. Contrôle de lésions hépatiques qui sur l'IRM du 12 octobre 2015 étaient en faveur de lésions secondaires. Absence de fixation des lésions hépatiques sur le TEP-scanner du 12 décembre 2015 à la différence des multiples lésions péritonéales. Régression des lésions péritonéales sur le dernier scanner de contrôle le 29 janvier 2016.\n \nPROTOCOLE :\nSéquence pondérée en T2, diffusion, T1 sans puis après injection de gadolinium.\n \nRESULTAT :\nComparaison à l'IRM du 12 octobre 2015.\n \nLe foie est de taille normale et présente des contours réguliers.\nLes veines sus-hépatiques et le tronc porte sont perméables.\n \nAspect inchangé de deux lésions hépatiques focales :\n- nodule de 12 mm du segment VI\n- nodule de 4 mm du segment III.\nCes deux nodules sont en hyposignal T1, non hépatocytaire, en hypersignal T2 persistant à TE long comme sur l'IRM pré-thérapeutique, avec restriction de la diffusion. Après injection, il existe une prise de contraste centripète progressive, sans motte périphérique. On retrouve une rétraction capsulaire en regard de la lésion du segment VI.\n \nPas de lésion hépatique focale nouvellement apparue.\n \nPas de dilatation des voies biliaires intra ou extrahépatiques.\nAbsence d'ascite.\n \n \nCONCLUSION :\nStabilité des deux nodules hépatiques non hépatocytaires par rapport à l'IRM de 2020 : lésion secondaire? Autre?\nNous restons à votre disposition pour la réalisation de biopsies hépatiques si nécessaire.",
    "English translation": "CLINICAL HISTORY:\nPatient has been followed since December 2014 for peritoneal carcinomatosis of ovarian origin. Monitoring of liver lesions that on the MRI of October 12, 2015, were suggestive of secondary lesions. No uptake of liver lesions on the PET scan of December 12, 2015, unlike the multiple peritoneal lesions. Regression of peritoneal lesions on the last control scan of January 29, 2016.\n\nProtocol:\nT2-weighted, diffusion, T1 sequences before and after gadolinium injection.\n\nResults:\nComparison with the MRI of October 12, 2015.\n\nThe liver is of normal size and has regular contours.\nThe suprahepatic veins and the portal trunk are permeable.\n\nUnchanged appearance of two focal hepatic lesions:\n\n12 mm nodule in segment VI\n4 mm nodule in segment III.\nBoth nodules show hypointensity on T1, non-hepatocyte, hyperintensity on T2 at long TE as in pre-therapeutic MRI, with diffusion restriction. After injection, there is progressive centripetal contrast enhancement, without peripheral clumping. Capsular retraction is observed in relation to the lesion in segment VI.\n\nNo new focal hepatic lesions.\n\nNo dilation of intrahepatic or extrahepatic bile ducts.\nNo ascites.\n\nIMPRESSION:\nStability of the two non-hepatocyte hepatic nodules compared to the MRI of 2020: secondary lesion? Other?\nWe remain at your disposal for performing hepatic biopsies if necessary.",
    "ICD-10 codes": "C56.9,C78.6"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Medulla",
    "Report": "IRM MÉDULLAIRE\n \nINDICATION :\nAntécédent de myélopathie par intoxication au protoxyde d'azote.\nRéapparition de polynévrite des membres inférieurs suite à une reprise de la consommation. Recherche de signes de myélite et de l'apparition d'une atteinte cordonale postérieure.\n \nPROTOCOLE : \nséquences sagittales T2, STIR, T1 sans et après injection de gadolinium. Séquence axiale T2 centrée sur C5-C7.\n \nRESULTAT :\nComparaison à l'IRM du 8 août 2023.\n \nAbsence d'anomalie morphologique ou de signal du cordon médullaire apparue.\n \nAbsence de prise de contraste pathologique du cordon médullaire, des racines de la queue de cheval et des méninges.\n \nRemaniements dégénératifs du rachis cervical, avec bombements discaux postérieurs en C5-C6 et C6-C7, entraînant un discret rétrécissement canalaire. \nPersistance d'espaces liquidiens péri-médullaires. \nAbsence d'anomalie de signal du cordon médullaire en regard.\nRespect des espaces liquidiens péri-médullaires par ailleurs.\n \n \nGoitre thyroïdien multinodulaire, à confronter aux données d'une échographie.\n \nCONCLUSION :\n- Absence d'argument IRM en faveur d'une myélopathie.\n- Goitre thyroïdien multinodulaire, à confronter aux données d'une échographie.",
    "English translation": "SPINAL MRI\n\nCLINICAL HISTORY:\nHistory of myelopathy due to nitrous oxide intoxication.\nReoccurrence of polyneuropathy in the lower limbs following resumption of consumption. Investigation for signs of myelitis and the development of posterior cord involvement.\n\nPROTOCOL:\nSagittal sequences T2, STIR, T1 with and without gadolinium enhancement. Axial T2 sequence centered on C5-C7.\n\nRESULT:\nComparison with MRI dated August 8, 2023.\n\nNo morphological abnormalities or signal changes in the spinal cord noted.\n\nNo pathological enhancement of the spinal cord, cauda equina roots, or meninges observed.\n\nDegenerative changes in the cervical spine, with posterior disc bulges at C5-C6 and C6-C7, causing slight canal narrowing.\nPersistence of perimedullary fluid spaces.\nNo signal abnormalities observed in the spinal cord at these levels.\nPerimedullary fluid spaces otherwise maintained.\n\nMultinodular thyroid goiter, to be correlated with ultrasound data.\n\nIMPRESSION:\nNo MRI evidence supporting myelopathy.\nMultinodular thyroid goiter, to be correlated with ultrasound data.",
    "ICD-10 codes": "G95.89,E04.2,M48.02,M53.82,G62.9"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Abdomen",
    "Report": "IRM DU PANCRÉAS ET DES VOIES BILIAIRES\n \nINDICATION :\nEn mars, Douleurs épigastriques, constipation, sans inflammatoire biologique. Aux Urgences, infiltration de la tête du pancréas en lien avec une pancréatite non sévère. Bilan étiologique. \n \nPROTOCOLE :\nSéquences morphologiques, oblique, de diffusion et après injection\n \nRESULTAT :\nFoie de taille et morphologie normales, stéatosique. Absence de lésion hépatique focale. Pas de dilatation des voies biliaires intra ou extrahépatiques. Pas d'anomalie vésicule biliaire, non distendue, à parois fines, alithiasique.\nPancréas de trophicité normale, en hypersignal T1 spontané physiologique. Canal pancréatique principal fin, de disposition modale.\nPas de lésion pancréatique focale visible.\nRate de taille normale. Intégrité des surrénales et des reins.\n \nCONCLUSION : Disparition de l'infiltration péri-pancréatique. Pas de collection intra ou péri-pancréatique ni autre lésion focale. Pas d'orientation étiologique en imagerie à la pancréatite aiguë.",
    "English translation": "MRI OF THE PANCREAS AND BILIARY TRACT\n\nCLINICAL HISTORY:\nIn March, epigastric pain, constipation, without biological inflammatory markers. At the Emergency Department, infiltration of the pancreatic head consistent with non-severe pancreatitis. Etiological assessment.\n\nPROTOCOL:\nMorphological sequences, oblique, diffusion, and post-contrast.\n\nRESULT:\nLiver of normal size and morphology, steatotic. No focal liver lesions. No dilatation of intrahepatic or extrahepatic bile ducts. No gallbladder abnormalities, not distended, with thin walls, stone-free.\nPancreas of normal trophicity, with physiological spontaneous T1 hyperintensity. Main pancreatic duct is thin and normally positioned.\nNo visible focal pancreatic lesions.\nSpleen of normal size. Integrity of the adrenal glands and kidneys.\n\nIMPRESSION:\nResolution of peripancreatic infiltration. No intra- or peripancreatic collections or other focal lesions. No imaging leads for the etiology of acute pancreatitis.",
    "ICD-10 codes": "R10.13, K86.9, K59.00,"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Brain",
    "Report": "SCANNER CÉRÉBRAL\n \nINDICATION :\nTroubles de la conscience chez une patiente en cours de bilan pour une tumeur frontale gauche.\n \nPROTOCOLE :\nAcquisition hélicoïdale sans injection.\n \nRESULTATS : comparaison au scanner du 12/10/2021.\n \nStabilité de la lésion frontale supérieure gauche de 41x32 mm, avec stabilité de l'œdème péri-lésionnel.\nPas d'effet de masse significatif sur les structures adjacentes.\nRégression de la déviation de la ligne médiane, en place. Pas d'engagement.\nPas d'hydrocéphalie.\nPas de lésion hémorragique cérébrale ou méningée apparue.\nPas de collection péri-cérébrale.\n \nCONCLUSION :\nStabilité de la lésion frontale supérieure gauche et de son œdème péri-lésionnel sans effet de masse significatif. \nPas de saignement intracrânien récent, d'engagement ni hydrocéphalie.",
    "English translation": "HEAD CT SCAN\n\nCLINICAL HISTORY:\nConsciousness disorders in a patient undergoing evaluation for a left frontal tumor.\n\nPROTOCOL:\nHelical acquisition without injection.\n\nRESULTS: comparison with the CT scan from 10/12/2021.\n\nStability of the left upper frontal lesion measuring 41x32 mm, with stability of the surrounding edema.\nNo significant mass effect on adjacent structures.\nRegression of midline shift, currently stable. No herniation.\nNo hydrocephalus.\nNo new cerebral or meningeal hemorrhagic lesions.\nNo peri-cerebral collection.\n\nIMPRESSION:\nStability of the left upper frontal lesion and its surrounding edema without significant mass effect.\nNo recent intracranial bleeding, herniation, or hydrocephalus.",
    "ICD-10 codes": "D43.0,G93.6"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Brain",
    "Report": "SCANNER CEREBRAL \nINDICATION :\nCéphalées chroniques\n \nTECHNIQUE :\nAcquisition hélicoïdale. Examen réalisé sans injection.\n \nRESULTAT :\n \nAbsence d’hémorragie intra ou péri-cérébrale.\nAbsence de syndrome de masse intracrânien\nAbsence d’anomalie de densité focale ou diffuse du parenchyme.\nMorphologie normale du système ventriculaire.\nAbsence d'engagement.\n \nComblement subtotal bilatéral des cellules ethmoïdales et total des sinus frontaux\nComblement polypoïde partiel des sinus maxillaires.\nÉpaississement muqueux en cadre des sinus sphénoïdaux\n\nCONCLUSION :\nPas de syndrome de masse intracrânien.\nComblement subtotal bilatéral des cellules ethmoïdales et total des sinus frontaux.",
    "English translation": "HEAD CT SCAN\n\nCLINICAL HISTORY:\nChronic headaches\n\nTECHNIQUE:\nHelical acquisition. Exam performed without injection.\n\nRESULT:\n\nNo intra or peri-cerebral hemorrhage.\nNo signs of intracranial mass effect.\nNo focal or diffuse density abnormalities in the parenchyma.\nNormal morphology of the ventricular system.\nNo herniation.\n\nSubtotal bilateral filling of the ethmoid cells and total filling of the frontal sinuses.\nPartial polypoid filling of the maxillary sinuses.\nMucosal thickening in the frame of the sphenoid sinuses.\n\nIMPRESSION:\nNo intracranial mass effect.\nSubtotal bilateral filling of the ethmoid cells and total filling of the frontal sinuses.",
    "ICD-10 codes": "J34.9"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Neck Thorax",
    "Report": "SCANNER CERVICO-THORACIQUE\n \nINDICATION :\nContrôle d'un carcinome de la margelle laryngée postérieure.\n \nPROTOCOLE :\nAcquisition hélicoïdale centrée sur la face et le cou après injection biphasique de produit de contraste. Acquisition après manœuvre de Valsalva. Acquisition à l'étage thoracique.\n \nRESULTAT :\n \nComparaison au scanner post-thérapeutique du 01/06/2022.\n\n1) A l'étage cervical :\n\n- Sur le plan muqueux :\nŒdème pharyngo-laryngé diffus, d'origine post-thérapeutique.\nStabilité d'un épaississement nodulaire de 11x9mm de la muqueuse laryngée postérieure, prenant discrètement le contraste.\nPas d'autre syndrome de masse ni rehaussement pathologique du nasopharynx, de la cavité orale, de l'oropharynx ou de l'hypopharynx.\n\n- Sur le plan ganglionnaire :\nInvolution adipeuse submandibulaire bilatérale.\nStabilité de la formation nodulaire située à la partie postérieure et inférieure de l'espace submandibulaire droit.\nStabilité en taille et en nombre des formations ganglionnaires jugulo-carotidiennes inférieures droites, de petit axe centimétrique.\n\n2) A l'étage thoracique :\n\n- En fenêtre médiastinale :\nPas d'adénomégalie axillaire, médiastinale ou hilaire.\nPas d'épanchement pleural ou péricardique.\nCardiomégalie globale, à prédominance bi-auriculaire.\nCalcifications pariétales de la crosse aortique, de l'artère inter-ventriculaire antérieure et de l'artère circonflexe\n\n- En fenêtre parenchymateuse :\nApparition d'une infiltration en verre dépoli bilatérale des régions inférieures, avec une plage bien limitée de S6 et S9D.\nBranchiolectrasies en bibasal.\nPas de masse ou condensation nodulaire suspecte.\nStabilité des 3 micronodules, d'allure non spécifique :\n- micronodule sous-pleural de S6D de 3 mm,\n- micronodule juxta-scissural de S5D de 2 mm,\n- micronodule de S2D de 2 mm.\nPas de nouveau nodule ou micronodule de taille significative.\nRégression de la condensation postéro-basale droite, confirmant sa nature infectieuse.\n\n- En fenêtre osseuse :\nApparition d'une fracture-tassement cunéiforme de T5, responsable d'une perte de hauteur d'environ 50% du corps vertébral, sans lyse corticale ni recul du mur vertébral postérieur.\nStabilité des tassements des plateaux supérieurs de T8 et de L1.\n\n\nCONCLUSION :\n- Stabilité de la formation nodulaire hypodense commissurale postérieure droite.\n- Pas d'adénomégalie cervicale.\n- Pas de nodule pulmonaire évolutif.\n- Apparition d'une infiltration en verre dépoli bilatérale prédominant à droite: origine infectieuse?",
    "English translation": "NECK AND LUNGS CT SCAN\n\nCLINICAL HISTORY:\nFollow-up of a carcinoma of the posterior laryngeal commissure.\n\nPROTOCOL:\nHelical acquisition focused on the face and neck following biphasic contrast injection. Acquisition post-Valsalva maneuver. Acquisition at the thoracic level.\n\nRESULT:\n\nComparison with post-therapeutic CT scan from 06/01/2022.\n\nCervical Level:\n\nMucosal aspect:\nDiffuse pharyngolaryngeal edema of post-therapeutic origin.\nStable nodular thickening measuring 11x9mm on the posterior laryngeal mucosa, showing slight contrast enhancement.\nNo other mass syndrome or pathological enhancement of the nasopharynx, oral cavity, oropharynx, or hypopharynx.\n\nLymph node aspect:\nBilateral submandibular adipose involution.\nStable nodular formation in the posterior and lower part of the right submandibular space.\nStable size and number of jugulocarotid lymph nodes at the lower right side, with a small centimeter axis.\n\nThoracic Level:\n\nMediastinal window:\nNo axillary, mediastinal, or hilar adenopathy.\nNo pleural or pericardial effusion.\nGlobal bi-atrial cardiomegaly.\nParietal calcifications of the aortic arch, anterior interventricular artery, and circumflex artery.\n\nParenchymal window:\nAppearance of bilateral ground-glass infiltration in the lower regions, with well-defined patches in segments S6 and S9D.\nBibasal bronchiolectasis.\nNo suspicious nodular mass or consolidation.\nStability of 3 nonspecific-looking micronodules:\n- Subpleural micronodule in S6D of 3 mm,\n- Juxtascissural micronodule in S5D of 2 mm,\n- Micronodule in S2D of 2 mm.\nNo new nodules or micronodules of significant size.\nRegression of the right posterobasal consolidation, confirming its infectious nature.\n\nOsseous window:\nAppearance of a wedge compression fracture of T5, resulting in approximately 50% height loss of the vertebral body, without cortical lysis or posterior vertebral wall retraction.\nStable compression of the superior endplates of T8 and L1.\n\nIMPRESSION: \n- Stability of the right posterior commissural hypodense nodular formation.\n- No cervical adenopathy.\n- No progressive pulmonary nodule.\n- Appearance of bilateral ground-glass infiltration predominantly on the right: infectious origin?",
    "ICD-10 codes": "C32.1,T66,J38.4,K11.0,I51.7,I70.01,R91.8,M48.54XA,M48.54XS,M48.56XS"
  },
  {
    "Language": "Fr",
    "Modality": "US",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "Echographie abdominopelvienne\n\nIndication: Suspicion d’appendicite chez une enfant de 6 ans avec une douleur en fosse iliaque droite. Pas de résultats de CRP à notre disposition.\n\nRésultats: Appendice de naissance latéro-caecale interne, vu dans sa totalité, augmenté de taille à 11mm à sa pointe, dédfférencié.\nInfiltration de la graisse péri-appendiculaire.\nPas d’abcès macroscopique.\nPas d’épanchement abdominopelvien.\n\nPar ailleurs,\nFoie normal. Pas de spnélomégalie. Vésicule biliaire alithiasique.\nReins de taille et de morphologie normales pour l’âge (96mm à gauche, 95mm à droite).\nPas de dilatation des cavités pyélocalicielles.\nVessie vide. Ovaires non vus.\n\nConclusion: Examen compatible avec une appendicite aigue non compliquée.",
    "English translation": "Abdominopelvic Ultrasound\n\nCLINICAL HISTORY: Suspected appendicitis in a 6-year-old child with right iliac fossa pain. No CRP results available.\n\nResults:\n\nAppendix originating from the internal lateral-cecal region, fully visualized, enlarged at 11mm at its tip, with loss of definition.\nInfiltration of the peri-appendicular fat.\nNo macroscopic abscess.\nNo abdominopelvic effusion.\n\nAdditionally:\nNormal liver. No splenomegaly. Gallbladder without stones.\nKidneys normal in size and morphology for age (96mm left, 95mm right).\nNo sign of urinary obstruction\nEmpty bladder. Ovaries not visualized.\n\nImpression: Findings consistent with uncomplicated acute appendicitis.",
    "ICD-10 codes": "R10.31,K35.80"
  },
  {
    "Language": "Fr",
    "Modality": "US",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "Echographie abdominopelvienne\n\nIndication: Bilan de douleurs abdominales chroniques chez une patiente de 45 ans.\n\nRésultats: Foie de taille et de morphologie normale.\nStéatose hépatique.\nPas de dilatation des voies biliaires intra ou extra hépatiques.\nVésicule biliaires aux parois fines, alithiasique.\nPerméabilité du tronc porte et des veines sus-hépatiques.\nPas de splénomégalie.\nTête du pancréas normale. Le reste de la glande n’est pas vu en raison d’interpositions digestives.\nReins de taille et de morphologie normales (environ 11cm à gauche comme à droite).\nPas de dilatation des cavités pyélocalicielles.\nPas de lithiase rénale visible.\nPas d’épanchement abdominopelvien.\nVessie en réplétion à contenu anéchogène.\n\nConclusion: Echographie normale en dehors d’une stéatose hépatique.",
    "English translation": "Abdominopelvic Ultrasound\n\nCLINICAL HISTORY: Evaluation of chronic abdominal pain in a 45-year-old female patient.\n\nResults:\n\nLiver is normal in size and morphology.\nHepatic steatosis.\nNo dilation of intrahepatic or extrahepatic bile ducts.\nGallbladder with thin walls, without stones.\nPatency of the portal trunk and suprahepatic veins.\nNo splenomegaly.\nNormal head of the pancreas. The rest of the gland is not visible due to intestinal overlay.\nKidneys normal in size and morphology (approximately 11 cm on both left and right).\nNo dilation of the pyelocaliceal cavities.\nNo visible renal stones.\nNo abdominopelvic effusion.\nBladder is full with anechoic content.\n\nImpression: Normal ultrasound except for hepatic steatosis.",
    "ICD-10 codes": "K76.0"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Thorax Abdomen Pelvis",
    "Report": "SCANNER THORACO-ABDOMINO-PELVIEN\n \nINDICATION :\nBilan de fin de traitement dans un contexte de leucémie lymphoïde chronique. \n \nTECHNIQUE :\nAcquisition hélicoïdale réalisée après injection IV de produit de contraste au temps veineux à l'étage cervico-thoraco-abdomino-pelvien.\n \nRESULTAT :\nComparaison avec le scanner antérieur du 15 mai 2018.\n \nA l'étage cervico-thoracique:\nRégression des multiples formations ganglionnaires sous-mandibulaires, jugulo-carotidiennes et spinales bilatérales précédemment décrite sans cible mesurable ce jour.\nPas d'adénomégalie médiastino-hilaire ou axillaire visualisée ce jour.\nPas d'épanchement pleural ou péricardique.\nStabilité en taille des micronodules pulmonaires précédemment décrits : de S2G de 4mm, paramédiastinale lobaire moyen de 5 mm et sous-pleural de S8 D de 4mm.\nPas de nodule pulmonaire nouvellement apparu.\nStabilité des troubles ventilatoires du lobe moyen et de la lingula.\n \nA l'étage abdomino-pelvien:\nStabilité de l'hépato-splénomégalie homogène (flèche hépatique droite à 17,5cm et flèche splénique à 14,5cm).\nRégression des adénomégalies cœlio-mésentériques, rétropéritonéales, pelviennes et inguinales précédemment décrites. Persistance d'une formation ganglionnaire du hile hépatique de 5 mm de petit axe (vs 30mm précédemment).\nGanglions pelviens bilatéraux infracentimétriques (respectivement 6mm de petit axe à droite et 7mm à gauche vs 28mm et 30mm).\nAspect stable du foie, de la vésicule biliaire, de la rate, du pancréas, des reins ou des surrénales.\nDiverticulose sigmoïdienne sans signe de complication.\nFiltre cave en place en position sous-rénale.\nPas d'épanchement liquidien intrapéritonéal. \n \nEn fenêtre osseuse :\nPas de lésion osseuse lytique ou condensante suspecte visualisée sur le volume exploré.\n \nCONCLUSION :\nRégression des adénomégalies sus et sous-diaphragmatiques précédemment décrites.",
    "English translation": "THORACO-ABDOMINO-PELVIC SCAN\n\nCLINICAL HISTORY:\nEnd-of-treatment assessment in the context of chronic lymphocytic leukemia.\n\nTECHNIQUE:\nHelical acquisition performed post-intravenous injection of contrast agent during venous phase, covering cervical, thoracic, abdominal, and pelvic regions.\n\nRESULT:\nComparison with previous scan dated May 15, 2018.\n\nCervico-thoracic region:\nRegression of multiple previously described nodal formations including submandibular, jugulo-carotid, and bilateral spinal nodes, with no measurable target today.\nNo mediastinal or axillary lymphadenopathy visualized today.\nNo pleural or pericardial effusion noted.\nStability in size of previously described pulmonary micronodules: 4mm at S2G, 5mm in the middle mediastinal lobe, and 4mm subpleural at S8D.\nNo newly appearing pulmonary nodules.\nStability of ventilatory disturbances in the middle lobe and lingula.\n\nAbdomino-pelvic region:\nStable homogeneous hepatosplenomegaly (right liver span at 17.5cm and splenic span at 14.5cm).\nRegression of previously described celiac-mesenteric, retroperitoneal, pelvic, and inguinal lymphadenopathies. Persistence of a nodal formation at the hepatic hilum measuring 5mm in short axis (vs 30mm previously).\nBilateral pelvic nodes are sub-centimetric (respectively 6mm on the right and 7mm on the left short axis vs 28mm and 30mm previously).\nStable appearance of the liver, gallbladder, spleen, pancreas, kidneys, and adrenal glands.\nSigmoid diverticulosis without signs of complication.\nInferior vena cava filter in place in subrenal position.\nNo intraperitoneal fluid effusion.\n\nBone window:\nNo lytic or sclerotic bone lesions suspected within the explored volume.\n\nIMPRESSION:\nRegression of previously described supra- and sub-diaphragmatic lymphadenopathies.",
    "ICD-10 codes": "R16.2,C91.91,R91.8,K57.30,Z95.8"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Thorax Abdomen Pelvis",
    "Report": "SCANNER THORACO-ABDOMINO-PELVIEN\n \nINDICATION :\nSurveillance chez une patiente aux antécédents de carcinome pulmonaire muté EGFR sous Tagrisso depuis août 2020 avec lésions secondaires pleurales et hépatiques. \n \nTECHNIQUE :\nAcquisition hélicoïdale réalisée après injection IV de produit de contraste au temps veineux en technique double énergie sur le thorax, l'abdomen et le pelvis.\n \nRESULTAT :\nComparaison avec le scanner antérieur du 3 janvier 2021.\n \nA l'étage thoracique:\nAspect stable de la condensation rétractile lobaire inférieure droite renfermant des bronchectasies, vraisemblablement post-radique.\nPas de nodule pulmonaire suspect apparu.\nStabilité des lésions emphysémateuses bilatérales prédominant dans les régions supérieures.\nAspect stable des épaississements pseudo-nodulaires de la plèvre et des scissures du côté droit, partiellement hyperdenses, à confronter aux antécédents (probable talcage).\nPas d'épanchement pleural ou péricardique.\nPas d'adénomégalie médiastino-hilaire.\n \nA l'étage abdomino-pelvien:\nStabilité des formations hypodenses intrahépatiques infracentimétriques (micro-kystiques ?).\nPas de lésion hépatique focale suspecte apparue.\nPas de masse surrénalienne.\nAspect inchangé de la rate, du pancréas et des reins.\nPas d'adénomégalie mésentérique ou lombo-aortique.\nPas d'épanchement liquidien intrapéritonéal.\n \nEn fenêtre osseuse :\nPas de lésion osseuse lytique ou condensante suspecte apparue sur le volume exploré.\n \nCONCLUSION :\nStabilité de l'examen par rapport à celui de janvier 2021.",
    "English translation": "THORACO-ABDOMINAL-PELVIC SCAN\n\nCLINICAL HISTORY:\nFollow-up in a female patient with a history of EGFR-mutated lung carcinoma on Tagrisso since August 2020 with secondary pleural and hepatic lesions.\n\nTECHNIQUE:\nHelical acquisition performed after IV injection of contrast material in venous timing using dual-energy technique on the chest, abdomen, and pelvis.\n\nRESULT:\nComparison with the previous scan from January 3, 2021.\n\nThorax\nStable appearance of the right lower lobar retractile consolidation containing bronchiectasis, likely post-radiation.\nNo suspicious pulmonary nodules appeared.\nStability of the bilateral emphysematous lesions predominating in the upper regions.\nStable appearance of pseudo-nodular thickenings of the pleura and fissures on the right side, partially hyperdense, to be correlated with history (probable talc pleurodesis).\nNo pleural or pericardial effusion.\nNo mediastinal or hilar lymphadenopathy.\n\nAbdomen: Stability of the subcentimeter hypodense intrahepatic formations (micro-cystic?).\nNo suspicious focal hepatic lesions appeared.\nNo adrenal mass.\nUnchanged appearance of the spleen, pancreas, and kidneys.\nNo mesenteric or lumbo-aortic lymphadenopathy.\nNo intraperitoneal fluid effusion.\n\nBone:\nNo suspicious lytic or sclerotic bone lesions appeared on the explored volume.\n\nIMPRESSION:\nStability of the examination compared to that of January 2021.",
    "ICD-10 codes": "C34.31,J70.1,J43.9,J92.9"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Thorax Abdomen Pelvis",
    "Report": "SCANNER THORACO-ABDOMINO-PELVIEN\n \nINDICATION :\nBilan de lymphome non hodgkinien folliculaire de diagnostic récent.\nRecherche d'adénopathie profonde.\n \nPROTOCOLE :\nAcquisition spiralée réalisée au temps veineux.\n \nRESULTAT :\nPoly-adénopathies et ganglions axillaires bilatéraux ; les plus gros au niveau axillaire droit, mesurent 18 x 17m de diamètre, au niveau axillaire gauche 22 x 16mm de diamètre.\nPrésence d'une adénopathie sous carinaire, centimétrique.\nPas d'adénopathie hilaire.\nPas d'épanchement pleural, ni péricardique.\n \n- Sur le plan parenchymateux pulmonaire :\nAucune nodule pulmonaire suspect visible.\nPas de lésion pleuro-parenchymateuse évolutive.\nAucune condensation pulmonaire.\n \n- Sur le plan abdomino-pelvien :\nFlèche du foie 16cm, flèche de la rate 13.4cm.\nAbsence de lésion focale hépatique suspecte.\nQuelques microkystes biliaires, très hypodenses, du segment VIII et du segment V.\nRate homogène.\nAbsence de masse surrénalienne.\nPas de lésion rénale.\nPas d'anomalie des voies biliaires.\nPrésence de plusieurs adénopathies cœlio-mésentériques et rétropéritonéales latéro-aortiques gauches, latéro-aortiques droites, inter-aortico-caves, pré-aortiques ; les plus gros au niveau du hile rénal gauche mesurent en site cible 33 x 21mm de diamètre, en latéro-cave deuxième cible abdominale 23 x 14mm de diamètre ; au niveau cœlio-mésentérique, la plus grosse mesure, en avant de l'artère mésentérique supérieure, 13 x 16.5mm de diamètre. Au niveau iliaque, présence également d'adénopathies iliaques externes droites et gauches mesurées à droite, à 26 x 14mm de diamètre, à gauche 18 x 12mm de diamètre.\nQuelques petits ganglions inguinaux droits et gauches, le plus volumineux à droite mesurant 13.5mm sur 18mm de diamètre.\n \n- Sur le plan osseux :\nAbsence de lésion osseuse lytique ou condensante sur le volume exploré.\n \n \nCONCLUSION :\n \nPoly-adénopathies essentiellement axillaires bilatérales et rétropéritonéales telle que décrites.\nPas d'anomalie viscérale.",
    "English translation": "CLINICAL HISTORY:\nEvaluation of recently diagnosed follicular non-Hodgkin's lymphoma.\nSearch for deep lymphadenopathy.\n\nPROTOCOL:\nSpiral acquisition performed during the venous phase.\n\nFINDINGS:\nMultiple axillary lymphadenopathies bilaterally; the largest in the right axillary region measure 18 x 17 mm in diameter, and in the left axillary region 22 x 16 mm in diameter.\nPresence of a subcarinal lymph node, centimetric in size.\nNo hilar lymphadenopathy.\nNo pleural or pericardial effusion.\n\nLung:\nNo visible suspicious pulmonary nodules.\nNo active pleuroparenchymal lesions.\nNo pulmonary consolidation.\n\nAbdomen:\nLiver span 16 cm, spleen span 13.4 cm.\nNo focal hepatic lesions of concern.\nSeveral very hypodense microcysts in hepatic segments VIII and V.\nSpleen is homogeneous.\nNo adrenal masses.\nNo renal lesions.\nNo abnormalities in the biliary tract.\nPresence of multiple celiomesenteric and retroperitoneal lymphadenopathies around the aorta on the left and right sides, inter-aortocaval, pre-aortic; the largest at the left renal hilum measuring 33 x 21 mm in diameter, laterocaval second abdominal target measuring 23 x 14 mm in diameter; at the celiomesenteric level, the largest anterior to the superior mesenteric artery measures 13 x 16.5 mm in diameter. In the iliac region, there are also external iliac lymphadenopathies on both right and left sides, measuring 26 x 14 mm on the right and 18 x 12 mm on the left.\nA few small right and left inguinal lymph nodes, the largest on the right measuring 13.5 x 18 mm in diameter.\n\nBone:\nNo lytic or sclerotic bone lesions within the explored volume.\n\nIMPRESSION:\nPolyadenopathies mainly bilateral axillary and retroperitoneal as described.\nNo visceral abnormalities.",
    "ICD-10 codes": "C82.98,R59.0"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Thorax Abdomen Pelvis",
    "Report": "SCANNER THORACO-ABDOMINO-PELVIEN\n \nINDICATION :\nRéévaluation d'un adénocarcinome colique en dissémination hépatique après 6 cures de chimiothérapie.\n \nTECHNIQUE :\nAcquisition spiralée d'emblée après injection au temps veineux aux étages thoracique, abdominal et pelvien.\n \nRESULTAT :\n \nComparaison au scanner thoraco-abdomino-pelvien précédent du 09/04/2017.\n \n1) A l'étage thoracique :\n \n- En fenêtre médiastinale :\nRégression partielle de l'adénomégalie cardio-phrénique antérieure droite, le plus volumineux ganglion mesurant 4 mm (contre 9 mm).\nPas d'adénomégalie axillaire, médiastinale ou hilaire.\nPas d'épanchement pleural ou péricardique.\nExtrémité distale du cathéter veineux du PAC en place.\nHernie hiatale par glissement.\n \n- En fenêtre parenchymateuse :\nPas de masse, nodule ou micronodule de taille significative.\nStabilité de l'infiltration réticulaire sous-pleurale basale droite.\n \n2) A l'étage abdomino-pelvien :\n \nRégression partielle de l'épaississement pariétal sigmoïdien, étendu sur 35 mm de hauteur (contre 55 mm), de l'infiltration péri-sigmoïdienne et des ganglions mésosigmoïdiens adjacents, le plus volumineux mesurant 6 mm (contre 9 mm).\nPas de nodule péritonéal suspect à distance. \n \nRégression partielle des lésions cibles hépatiques :\n- cible du segment IV A, mesurant 72 mm (contre 87 mm),\n- cible sous-capsulaire postérieur du segment III, mesurant 45 mm (contre 51 mm).\nRégression partielle des lésions non cibles hépatiques.\nPas de nouvelle lésion identifiée.\n \nPerméabilité des axes vasculaires hépatiques afférents et efférents.\nPas de dilatation des voies biliaires intra-hépatiques ou de la voie biliaire principale.\nVésicule à paroi fine.\nPas d'anomalie pancréatique, splénique, rénale ou surrénalienne.\nStabilité en taille et en nombre des adénomégalies cœliaques, le plus volumineux ganglion étant de topographie inter-porto-cave et mesure 13 mm (contre 14 mm).\nPas d'adénomégalie rétro-péritonéale ou pelvienne.\nPas d'épanchement liquidien intra-péritonéal.\n \n3) En fenêtre osseuse :\nPas de lésion osseuse lytique ou condensante suspecte décelée sur le squelette exploré.\n \nCONCLUSION :\n- Réponse partielle sigmoïdienne et hépatique.\n- Pas de nouvelle lésion identifiée.",
    "English translation": "THORACO-ABDOMINO-PELVIC SCAN\n\nCLINICAL HISTORY:\nRe-evaluation of metastatic colonic adenocarcinoma after 6 cycles of chemotherapy.\n\nTECHNIQUE:\nSpiral acquisition immediately post-contrast in the venous phase at the thoracic, abdominal, and pelvic levels.\n\nRESULT:\n\nComparison with the previous thoraco-abdomino-pelvic CT scan dated 04/09/2017.\n\nThorax:\n\nIn the mediastinal window:\nPartial regression of the right cardiophrenic adenopathy, the largest node now measuring 4 mm (previously 9 mm).\nNo axillary, mediastinal, or hilar adenopathy.\nNo pleural or pericardial effusion.\nDistal end of the PAC venous catheter in place.\nSliding hiatal hernia.\n\nIn the lung parenchyma:\nNo significant masses, nodules, or micronodules.\nStability of the right basal subpleural reticular infiltration.\nAbdomen:\n\nPartial regression of sigmoid wall thickening, now 35 mm in height (previously 55 mm), peri-sigmoid infiltration, and adjacent mesosigmoid nodes, the largest node now measuring 6 mm (previously 9 mm).\nNo distant suspicious peritoneal nodules.\n\nPartial regression of targeted hepatic lesions:\n\nTarget in segment IV A, now measuring 72 mm (previously 87 mm),\nPosterior subcapsular target in segment III, now measuring 45 mm (previously 51 mm).\nPartial regression of non-target hepatic lesions.\nNo new lesions identified.\n\nPermeability of the afferent and efferent hepatic vascular axes.\nNo dilation of the intrahepatic bile ducts or the main bile duct.\nGallbladder with thin wall.\nNo pancreatic, splenic, renal, or adrenal abnormalities.\nStability in size and number of celiac adenopathies, the largest node located in the interporto-caval area measuring 13 mm (previously 14 mm).\nNo retroperitoneal or pelvic adenopathy.\nNo intra-peritoneal fluid collection.\n\nBone:\nNo suspicious lytic or sclerotic bone lesions detected on the explored skeleton.\n\nIMPRESSION:\n\nPartial sigmoid and hepatic response.\nNo new lesions identified.",
    "ICD-10 codes": "C18.7,C78.7,R91.8"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Spine",
    "Report": "SCANNER DU RACHIS LOMBAIRE\n \nINDICATION :\nBilan d'une sciatique gauche.\n \nPROTOCOLE :\nAcquisition hélicoïdale sans injection de produit de contraste.\n \nRESULTAT :\nAbsence de lésion osseuse suspecte.\nRespect de hauteur des corps vertébraux.\nAbsence de listhésis.\nAbsence d'anomalie transitionnelle de la charnière lombosacrée.\n \nCanal lombaire constitutionnellement étroit, mesuré 14 mm de diamètre antéro-postérieur.\n \nRemaniements dégénératifs pluri-étagés du rachis lombaire bas à type de discopathie dégénérative et d'arthrose zygapophysaire.\n \nÉtage L4-L5 :\nDébord discal global et arthrose zygapophysaire bilatérale modérée, responsable d'une sténose foraminale bilatérale modérée.\n \nÉtage L5-S1 :\nDébord discal global avec arthrose zygapophysaire bilatérale modérée à sévère, responsables d'une sténose foraminale bilatérale modérée.\n \nCONCLUSION :\nCanal lombaire constitutionnellement étroit, avec remaniements dégénératifs pluri-étagés du rachis lombaire bas responsable de sténoses foraminales bilatérales modérées aux étages L4-L5 et L5-S1.",
    "English translation": "LUMBAR SPINE CT\n\nCLINICAL HISTORY:\nEvaluation of left-sided sciatica.\n\nTECHNIQUE:\nHelical acquisition without contrast injection.\n\nFINDINGS:\nNo suspicious bone lesion observed.\nNormal vertebral body heights maintained.\nNo evidence of spondylolisthesis.\nNo transitional anomaly at the lumbosacral junction.\n\nConstitutionally narrow lumbar canal, measuring 14 mm in anteroposterior diameter.\n\nMultilevel degenerative changes in the lower lumbar spine including degenerative disc disease and facet arthrosis.\n\nL4-L5:\nGlobal disc protrusion and moderate bilateral facet arthrosis, causing moderate bilateral foraminal stenosis.\n\nL5-S1:\nGlobal disc protrusion with moderate to severe bilateral facet arthrosis, causing moderate bilateral foraminal stenosis.\n\nIMPRESSION:\nConstitutionally narrow lumbar canal with multilevel degenerative changes in the lower lumbar spine causing moderate bilateral foraminal stenoses at L4-L5 and L5-S1 levels.",
    "ICD-10 codes": "M54.32,M48.06,M48.26,M51.36"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Ears",
    "Report": "SCANNER DES ROCHERS\n \nINDICATION :\nBilan d'une surdité de transmission droite.\n \nPROTOCOLE :\nAcquisition sans injection.\n \nRESULTAT :\nOreille droite :\nBonne aération du conduit auditif externe, de l'oreille moyenne et des cellules mastoïdiennes.\nMembrane tympanique fine.\nIntégrité de la chaîne ossiculaire.\nBonne aération des fenêtres ronde et ovale.\nPas de foyer d'hypodensité pré-stapédien.\nIntégrité morphologique de la cochlée, du vestibule et des canaux semi-circulaires.\nDéhiscence du canal semi-circulaire supérieur étendu sur 6 mm.\nPas de procidence du canal du nerf facial.\n \nOreille gauche :\nBonne aération du conduit auditif externe, de l'oreille moyenne et des cellules mastoïdiennes.\nMembrane tympanique fine.\nIntégrité de la chaîne ossiculaire.\nBonne aération des fenêtres ronde et ovale.\nPas de foyer d'hypodensité pré-stapédien.\nIntégrité morphologique de la cochlée, du vestibule et des canaux semi-circulaires.\nPas de déhiscence du canal semi-circulaire supérieur.\nPas de procidence du canal du nerf facial.\n \n \n \nCONCLUSION :\nDéhiscence du canal semi-circulaire supérieur droit étendu sur 6 mm (images clés sur le PACS).\n \nIntégrité des chaînes ossiculaires.\nPas de signe évocateur de séquelles infectieuses.",
    "English translation": "EAR CT\n\nCLINICAL HISTORY:\nEvaluation of right-sided conductive hearing loss.\n\nPROTOCOL:\nAcquisition without injection.\n\nRESULTS:\n\nRight Ear:\nGood aeration of the external auditory canal, middle ear, and mastoid cells.\nThin tympanic membrane.\nIntegrity of the ossicular chain.\nGood aeration of the round and oval windows.\nNo hypodensity foci pre-stapedius.\nMorphological integrity of the cochlea, vestibule, and semicircular canals.\n6 mm dehiscence of the superior semicircular canal.\nNo protrusion of the facial nerve canal.\n\nLeft Ear:\nGood aeration of the external auditory canal, middle ear, and mastoid cells.\nThin tympanic membrane.\nIntegrity of the ossicular chain.\nGood aeration of the round and oval windows.\nNo hypodensity foci pre-stapedius.\nMorphological integrity of the cochlea, vestibule, and semicircular canals.\nNo dehiscence of the superior semicircular canal.\nNo protrusion of the facial nerve canal.\n\nIMPRESSION:\n6 mm dehiscence of the right superior semicircular canal (key images on PACS).\n\nIntegrity of the ossicular chains.\nNo signs suggestive of infectious sequelae.",
    "ICD-10 codes": "Q16.5,H90.11"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Ears",
    "Report": "SCANNER DES ROCHERS\n \nINDICATION :\nBilan d'une perforation tympanique gauche et d'une rétraction sous-ligamentaire postérieure droite.\n \nPROTOCOLE :\nAcquisition spiralée sans injection centrée sur les rochers.\n \nRÉSULTATS :\n \n1/ Oreille droite :\nPneumatisation normale de l'oreille moyenne et des cellules mastoïdiennes, et notamment des fenêtres ovale et ronde.\nPas d'anomalie de la chaîne ossiculaire.\nPas d'hypodensité pré-stapédienne .\nCouverture normale du canal semi-circulaire supérieur.\nIntégrité du canal osseux du nerf facial.\nIntégrité des structures constitutives de l'oreille interne.\n \n2/ Oreille gauche :\nOstéocondensation et hypopneumatisation mastoïdienne (aspect éburné).\nPneumatisation normale de l'oreille moyenne et des cellules mastoïdiennes, et notamment des fenêtres ovale et ronde.\nPas d'anomalie de la chaîne ossiculaire.\nPas d'hypodensité pré-stapédienne .\nCouverture normale du canal semi-circulaire supérieur. \nDéfaut de visualisation de la partie postérieure du tegmen tympani et du tegmen antri, sans ptose méningée ou méningo-encéphalique : déhiscence?\nIntégrité du canal osseux du nerf facial.\nIntégrité des structures constitutives de l'oreille interne.\nProcidence mastoïdienne du sinus sigmoïde.\nPosition haute du golfe jugulaire.\n \nCONCLUSION :\n- Intégrité de l'oreille droite.\n- A gauche :\n• Stigmate d'otite chronique non cholestéatomateuse, sans comblement oto-mastoïdien ni diastasis incudo-stapédien.\n• Défaut de visualisation de la partie postérieure du tegmen tympani et du tegmen antri, sans ptose méningée ou méningo-encéphalique : déhiscence?",
    "English translation": "Study: Temporal Bone CT\n\nCLINICAL HISTORY:\nAssessment of left tympanic membrane perforation and right posterior sub-ligamentary retraction.\n\nProtocol:\nSpiral acquisition without injection focused on the petrous bones.\n\nFindings:\n\nRight Ear:\n\nNormal pneumatisation of the middle ear and mastoid air cells, including the oval and round windows.\nNo abnormalities in the ossicular chain.\nNo pre-stapedial hypodensity.\nNormal coverage of the superior semicircular canal.\nIntegrity of the bony canal of the facial nerve.\nIntegrity of the structures of the inner ear.\n\nLeft Ear:\n\nOsteocondensation and mastoid hypopneumatisation (sclerotic appearance).\nNormal pneumatisation of the middle ear and mastoid air cells, including the oval and round windows.\nNo abnormalities in the ossicular chain.\nNo pre-stapedial hypodensity.\nNormal coverage of the superior semicircular canal.\nNon-visualization of the posterior part of the tegmen tympani and the tegmen antri, without meningeal or meningoencephalic prolapse: possible dehiscence?\nIntegrity of the bony canal of the facial nerve.\nIntegrity of the structures of the inner ear.\nProtrusion of the sigmoid sinus in the mastoid.\nHigh position of the jugular bulb.\n\nIMPRESSION:\n\nRight ear is intact.\nLeft ear:\n- Signs of non-cholesteatomatous chronic otitis, without oto-mastoid filling or incudostapedial diastasis.\n- Non-visualization of the posterior part of the tegmen tympani and the tegmen antri, without meningeal or meningoencephalic prolapse: possible dehiscence?",
    "ICD-10 codes": "H65.492,H72.92,H73.91"
  },
  {
    "Language": "Fr",
    "Modality": "US",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "Indication: Bilan d’une insuffisance rénale aigue\n\nRésultats: \nRein droit: Axe bipolaire à 12.2cm. Pas de syndrome de masse. Bonne différenciation cortico-médullaire. Trophicité corticale normale. Pas de lithiase visible en échographie. Pas de dilatation des cavités pyélocalicielles.\nRein gauche: Axe bipolaire à 11.7cm. Pas de syndrome de masse. Bonne différenciation cortico-médullaire. Trophicité corticale normale. Pas de lithiase visible en échographie. Pas de dilatation des cavités pyélocalicielles.\nVessie quasi-vide. \nPas d’épanchement pelvien.\nConclusion: Echographie rénale normale.",
    "English translation": "CLINICAL HISTORY: Assessment of acute renal failure\n\nResults:\nRight kidney: Bipolar axis measures 12.2 cm. No mass effect. Good corticomedullary differentiation. Normal cortical trophicity. No stones visible on ultrasound. No dilation of the pyelocaliceal cavities.\nLeft kidney: Bipolar axis measures 11.7 cm. No mass effect. Good corticomedullary differentiation. Normal cortical trophicity. No stones visible on ultrasound. No dilation of the pyelocaliceal cavities.\nBladder: Nearly empty.\nNo pelvic effusion.\nIMPRESSION: Normal renal ultrasound.",
    "ICD-10 codes": "N17.9"
  },
  {
    "Language": "Fr",
    "Modality": "US",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "Echographie rénale\n\nIndication: Bilan d’une pyélonéphrite gauche à risque de complication chez une femme de 45 ans suivie pour un diabète mal équilibré\n\nRésultats:\nDilatation des cavités pyélocalicielles gauches avec un bassinet mesuré à 18mm en inter-labial. L’uretère est mal suivi en raison de la faible échogénéicité de la patiente. \nRein gauche à 13cm de diamètre.\nTrophicité corticale gauche conservée.\nPas d’abcès.\n\nRein droit normal, mesuré à 12cm de diamètre, sans dilatation des cavités pyélocalicielles.\n\nConclusion: Dilatation des cavités pyélocalicielles gauches. L’uretère gauche n’est pas suivi: intérêt d’un scanner complémentaire. Rein droit normal.",
    "English translation": "Kidney Ultrasound\n\nCLINICAL HISTORY: Evaluation of a left pyelonephritis with complication risk in a 45-year-old woman with poorly controlled diabetes.\n\nResults:\n\nLeft hydronephrosis with a pelvis measured at 18mm inter-labially. The ureter is poorly visualized due to the patient's low echogenicity.\nLeft kidney measures 13 cm in diameter.\nPreserved left cortical trophicity.\nNo abscess.\n\nNormal right kidney, measuring 12 cm in diameter, without dilation of the pyelocalyceal cavities.\n\nIMPRESSION: Left hydronephrosis. The left ureter is not visualized: further assessment with CT scan is recommended. Right kidney is normal.",
    "ICD-10 codes": "N13.30,E13.8,N13.6,R94.4"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Pelvis",
    "Report": "IRM PROSTATIQUE \n\nIndication\nÉlévation du taux de PSA.\n\nProtocole\nSéquences axiales T2 et diffusion.\n\nRésultats\nPas d'imagerie antérieure disponible pour comparaison.\n\nVolume prostatique estimé à 95 cc (50 x 70 x 52 mm).\nProtrusion modérée du lobe médian dans la vessie.\nÉpaississement significatif des parois vésicales avec multiples petits diverticules.\n\nZone périphérique :\nQuelques remaniements inflammatoires ne gênant pas l'interprétation.\nRestriction focale marquée de la diffusion latéro-lobaire moyen gauche (z10p) de 7 mm.\nPas de signe d’extension extra-prostatique.\n\nZone de transition :\nPas de lésion significative.\n\nPar ailleurs :\nStroma fibromusculaire antérieur fin et très hypointense en T2, sans restriction de diffusion.\nAspect normal des vésicules séminales.\nPas d'adénopathie pelvienne.\nPas de lésion osseuse suspecte.\n\n\nConclusion\nLésion suspecte PI-RADS 4 en zone périphérique latéro-lobaire moyenne gauche.\nHypertrophie prostatique (95 cc) avec signes de vessie de lutte.",
    "English translation": "PROSTATE MRI\n\nClinical information\nElevated PSA.\n\nTechnique\nAxial T2 and DWI/ADC.\n\nComparison\nNone.\n\nFindings\n\nSize : 95 cubic cm (50 x 70 x 52 mm).\nMild median lobe hypertrophy protruding into the urinary bladder.\nDiffuse bladder wall hypertrophy. Multiple small bladder diverticula.\n\nPeripheral zone :\nSlightly heterogeneous high signal.\nLeft midgland posterolateral focal markedly hyperintense on high b-value and markedly hypointense on ADC, which does not abut the prostate margin.\n\nTransition zone :\nNo significant abnormality.\n\nOther :\nNormal anterior fibromuscular stroma and seminal vesicles.\nNo lymphadenopathy.\nNo osseous metastases suggested.\n\n\nImpression\nHigh suspicion left peripheral zone lesion without extraprostatic extension.\nProstatomegaly (95 cc) with bladder outlet obstruction.",
    "ICD-10 codes": "N40, D40.0, D32.3"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "IRM RENALE\n\nIndication\nCaractérisation d'une masse rénale droite.\n\nProtocole\nSéquences axiales et coronale T2, axiale diffusion, après injection axiales T1 fat sat dynamique, T1 tardif et temps excréteur.\n\nRésultats\n\nMasse rénale de la convexité du pôle inférieur du rein droit de 47 x 38 mm pour 32 mm de hauteur, plurilobulé, hétérogène globalement iso-intense en T2 et en T1, avec restriction modérée de la diffusion, hypervascularisée avec lavage au temps tardif et composantes nécrotiques minoritaires.\nCette masse vient au contact de la tige calicielle inférieure sans l'envahir.\nVeine rénale droite perméable.\nArtère rénale polaire inférieure droite.\nPas d'adénomégalie rétropéritonéale.\n\nFormations liquidiennes rénales bilatérales infra et péricentimétriques d'allure banale.\nRein gauche de taille et de morphologie normales, sans lésion tissulaire suspecte.\nPas de lésion suspecte dans les voies urinaires.\nIntégrité des surrénales, du foie, du pancréas et de la rate.\nPas de lésion osseuse suspecte sur le volume exploré.\n\n\nConclusion\nMasse rénale droite hypervascularisée compatible avec un carcinome à cellules claires.",
    "English translation": "Renal MRI Report\nIndication Characterization of a right renal mass.\nProtocol Axial and coronal T2 sequences, axial diffusion, post-contrast axial T1 fat-sat dynamic, late T1, and excretory phase.\nFindings\nA 47 x 38 mm mass on the convexity of the lower pole of the right kidney, with a height of 32 mm, appears multilobulated and heterogeneous. The mass is generally iso-intense on both T2 and T1 sequences, shows moderate diffusion restriction, is hypervascular with washout in the late phase, and contains minor necrotic components.\nThe mass is in contact with but does not invade the lower caliceal stem.\nThe right renal vein is patent.\nThere is a right lower polar renal artery.\nNo retroperitoneal lymphadenopathy.\nBilateral renal cysts, infra- and pericentimetric, appear benign.\nThe left kidney is of normal size and morphology, without any suspicious tissue lesions.\nNo suspicious lesions in the urinary tract.\nThe adrenal glands, liver, pancreas, and spleen are intact.\nNo suspicious bone lesions within the explored volume.\nConclusion A hypervascular right renal mass compatible with clear cell carcinoma.",
    "ICD-10 codes": "C64.1, N28.1"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Pelvis",
    "Report": "IRM DYNAMIQUE PELVIPERINEALE\n\nIndication\nBilan d'urgenturies. Antécédents d'hystérectomie en 2021 et de pose de bandelette TOT en 2016.\n\nProtocole\nAprès balisage rectal et vaginale au gel d'échographie, séquences T2 dans les trois plans, sagittales en poussée progressive, puis trois plans T2 en poussée maximale.\nSéquence axiale T2 BFFE jusqu'aux hiles rénaux.\n\nRésultats\n\nConcernant l'examen dynamique :\nCervicocystoptose de grade II avec partie inférieure de l'urètre restant fixé par le matériel prothétique et bascule à 90° postérieure de la partie supérieure de l'urètre.\nFine dissection graisseuse de la cloison rectovaginale sans péritonéocèle.\nAbsence de rectocèle.\n\nPar ailleurs :\nStigmates d'hystérectomie.\nPas de syndrome de masse pelvien.\nPas d'épanchement liquidien pelvien.\nPas d'adénomégalie sur le volume exploré.\nPas de dilatation des cavités pyélocalicielles.\nTrophicité conservée des faisceaux du muscle releveur de l'anus.\n\n\nConclusion\nCervicocystoptose de grade II.",
    "English translation": "MR DEFECOGRAPHY\n\nHistory\nAssessment for urinary urgency. History of hysterectomy in 2021 and TOT sling placement in 2016.\n\nProtocol\nAfter rectal and vaginal marking with ultrasound gel, T2 sequences in three planes, sagittal during progressive straining, followed by three-plane T2 sequences during maximal straining. Axial T2 BFFE sequence up to the renal hila.\n\nResults\n\nRegarding the dynamic examination:\nGrade II cervicocystoptosis with the lower part of the urethra remaining fixed by the prosthetic material and a 90° posterior tilt of the upper part of the urethra.\nFine fatty dissection of the rectovaginal septum without peritoneocele.\nNo rectocele.\n\nOther:\nSigns of hysterectomy.\nNo pelvic mass syndrome.\nNo pelvic fluid collection.\nNo lymphadenopathy.\nNo dilation of the pelvicalyceal system.\nPreserved trophicity of the levator ani muscle bundles.\n\n\nImpression\nGrade II cervicocystoptosis.",
    "ICD-10 codes": "R39.15, N81.10, Z90.711"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "SCANNER ABDOMINOPELVIEN\n\nIndication\nBilan de vomissements avec altération de l’état général chez un homme de 25 ans.\n\nProtocole\nAcquisition après injection au temps veineux.\n\nRésultats\nÉpaississement circonférentiel pariétal centimétrique de l'antre gastrique.\nMultiples ganglions infra et péricentimétriques cœliomésentériques, inter-aortico-caves et latéroaortiques gauches.\nNodules tissulaires dans le grand omentum dont le plus volumineux mesure 14 x 9 mm en région périombilicale gauche.\nLame d'épanchement péritonéal pelvien.\nPar ailleurs, pas d'anomalie rénale, hépatobiliaire, pancréatique ni splénique.\nPas de lésion osseuse suspecte.\n\nConclusion\nAspect suspect de linite gastrique avec lésions de carcinose péritonéale.",
    "English translation": "Abdominopelvic CT Scan Report\nIndication Assessment of vomiting and general deterioration in a 25-year-old male.\nProtocol Post-contrast acquisition during the venous phase.\nFindings\nCentimetric circumferential wall thickening of the gastric antrum.\nMultiple infra- and pericentimetric lymph nodes in the celiac-mesenteric, interaortocaval, and left para-aortic regions.\nTissue nodules in the greater omentum, the largest measuring 14 x 9 mm in the left peri-umbilical region.\nThin layer of pelvic peritoneal effusion.\nNo renal, hepatobiliary, pancreatic, or splenic abnormalities.\nNo suspicious bone lesions.\nConclusion Findings are suggestive of gastric linitis with peritoneal carcinomatosis.",
    "ICD-10 codes": "R11.10, C16.3, C78.6"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "UROSCANNER\n\nIndication\nBilan d'une hématurie macroscopique. Cystoscopie réalisée il y a une semaine sans lésion retrouvée. Recherche de tumeur dans les voies excrétrices supérieures.\n\nProtocole\nAcquisitions sans puis après injection de produit de contraste, potentialisées par l’injection intraveineuse de furosémide, aux temps cortical, tubulaire et excréteur. On complète par une acquisition tardive en procubitus.\n\nRésultats\n\nCollection hydroaérique latérovésicale gauche pluriloculée de 13 x 4 cm pour 6 cm de hauteur.\nSuffusion gazeuse dans l'espace sous-péritonéal, dans le cordon spermatique gauche et dans l'espace propéritonéal.\nPas de solution de continuité décelable de la paroi vésicale, ni de fuite extravésicale du produit de contraste au temps excréteur.\n\nConcernant les voies excrétrices urinaires :\nSédiment hématique intravésical.\nDeux diverticules rétrovésicaux de 5 et 4 cm de large, avec collets de 6 et 8 mm.\nLésion tissulaire rehaussée dans le fond du diverticule rétrovésicale droit mesurant 12 x 5 mm.\nPas de lésion suspecte urétéro pyélocalicielle bilatérale, vésicale, ni rénale par ailleurs.\nPas dilatation des cavités pyélocalicielles.\n\nConcernant le reste de l'examen :\nPas d'adénomégalie pelvienne ni rétropéritonéale.\nDysmorphie hépatique aux contours bosselés.\nPas de voie dérivation veineuse porto-systémique significative.\nMicrocalculs vésiculaires sans signe de complication.\nReins de taille et morphologie normales sans lésion significative.\nPas de lésion osseuse suspecte.\n\n\nConclusion\nCollection hydroaérique latérovésicale gauche : complication de la cystoscopie récente ? \nUrologue prévenu des constatations et patient hospitalisé.\n\nLésion tissulaire nodulaire centimétrique dans un diverticule rétrovésical droit suspecte.",
    "English translation": "CT UROGRAM\n\nIndication\nGross hematuria. Cystoscopy performed a week ago showed no lesions.\n\nProtocol\nHelical images pre and post IV contrast after IV furosemide, during the cortical, tubular, and excretory phases. Completed with a delayed acquisition in the prone position.\n\n\nFindings\n\nMultiloculated hydroaeric collection in the left lateral vesical region measuring 13 x 4 cm and 6 cm in height.\nGas suffusion in the subperitoneal space, left spermatic cord, and properitoneal space.\nNo detectable wall discontinuity of the bladder, nor extravesical leakage of contrast during the excretory phase.\n\nRegarding the urinary excretory pathways:\nIntravesical hematic sediment.\nTwo retrovesical diverticula measuring 5 and 4 cm in width, with necks of 6 and 8 mm.\nEnhanced tissue lesion in the base of the right retrovesical diverticulum measuring 12 x 5 mm.\nNo suspicious lesions in the ureteropyelocaliceal systems bilaterally, bladder, or kidneys.\nNo dilation of the pelvicalyceal systems.\n\nOther findings:\nNo pelvic or retroperitoneal lymphadenopathy.\nDysmorphic liver with cirrhotic appearance.\nNo porto-systemic venous shunt.\nKidneys of normal size and morphology.\nSmall gallstones without signs of complication.\nKidneys of normal size and morphology without significant lesion.\nNo suspicious bone lesions.\n\n\nImpression\nLeft lateral vesical hydroaeric collection: complication of recent cystoscopy? Urologist informed of the findings and patient hospitalized.\nSuspected nodular tissue lesion in the right retrovesical diverticulum.",
    "ICD-10 codes": "R31.0, C67.9, N32.3, C74.6"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Thorax Abdomen Pelvis",
    "Report": "SCANNER THORACO-ABDOMINO-PELVIEN\n\nIndication\nÉtat de choc hémodynamique. Suspicion de dissection aortique.\n\nProtocole\nAcquisitions sans injection à l'étage thoracique, puis après injection au temps artériel sur les étages thoraco-abdomino-pelvien, puis au temps veineux sur l'étage abdomino-pelvien.\n\nRésultats\n\nThorax :\nDéfaut de rehaussement sous-endocardique des parois latérales et inférieures du ventricule gauche, ainsi que des piliers antérieur et postérieur de la valve mitrale, pouvant témoigner d'un infarctus.\nPas de signe de syndrome aortique aigu.\nPas d'embolie pulmonaire jusqu'au niveau segmentaire.\nÉpanchements pleuraux bilatéraux de moyenne abondance prédominant à droite.\nAtélectasie partielle bibasale au contact.\nQuelques réticulations interlobulaires biapicales pouvant témoigner d'une surcharge vasculaire.\nCalcifications coronariennes tritronculaires.\nPas d'épanchement péricardique.\n\nAbdomen et pelvis :\nPneumopéritoine de moyenne abondance prédominant en position sus-mésocolique.\nÉpanchement liquidien péritonéal de moyenne abondance périhépatique et pelvien.\nPrise de contraste des feuillets péritonéaux dans le pelvis et de la capsule hépatique, évoquant des signes de péritonite.\nRehaussement satisfaisant des parois des anses intestinales.\nPas de solution de continuité gastroduodénale décelable.\nŒdème sous-muqueux circonférentiel vésiculaire d'allure réactionnelle avec deux macrocalculs.\n\nPar ailleurs :\nEncoches cortico-rénales bilatérales d'allure séquellaire.\nPrise de contraste intense des surrénales au temps artériel cadrant avec l’état de choc.\nPas de lésion suspecte du foie, de la rate, ni du pancréas.\nIntégrité du cæcum, de la dernière anse iléale et de l'appendice.\nPas de lésion osseuse suspecte sur le volume exploré.\n\n\nConclusion\nPas d'argument pour un syndrome aortique aigu.\nDéfaut de rehaussement sous-endocardique du ventricule gauche : infarctus ? \nSignes d'œdème pulmonaire débutant avec épanchements pleuraux bilatéraux de moyenne abondance.\n\nPneumopéritoine prédominant en position sus-mésocolique : perforation d’ulcère gastroduodénale ?",
    "English translation": "CT CHEST, ABDOMEN and PELVIS\n\nClinical impression\nHemodynamic shock. Suspected aortic dissection.\n\nProtocol\nHelical images without contrast on the thorax, followed by post-IV contrast images during the arterial phase from the lung apices to the pubic symphysis, and during the venous phase from the lung bases to the pubic symphysis.\n\nResults\n\nThorax:\nSubendocardial enhancement defect of the lateral and inferior walls of the left ventricle which may indicate an infarction.\nNo signs of acute aortic syndrome.\nNo pulmonary embolism.\nModerate bilateral pleural effusions, predominantly on the right.\nBiapical interlobular reticulations possibly indicating vascular overload.\nCoronary calcifications. No pericardial effusion.\n\nAbdomen and pelvis:\nModerate pneumoperitoneum predominantly supramesocolic.\nModerate amount of peritoneal fluid effusion around the liver and in the pelvis.\nEnhancement of the peritoneal layers in the pelvis and hepatic capsule, suggesting peritonitis.\nSatisfactory enhancement of the intestinal walls.\nNo detectable gastroduodenal wall discontinuity.\nCircumferential submucosal gallbladder edema with a reactive appearance and two large gallstones.\n\nAdditionally:\nBilateral cortical renal notches with a reactive appearance.\nIntense adrenal contrast enhancement during the arterial phase consistent with the state of shock.\nNo suspicious lesions in the liver, spleen, or pancreas.\nIntegrity of the cecum, terminal ileum, and appendix.\nNo suspicious bone lesions in the explored volume.\n\nImpression\nNo evidence of acute aortic syndrome.\nSubendocardial enhancement defect of the left ventricle: infarction?\nSigns of early pulmonary edema with moderate bilateral pleural effusions.\nSupramesocolic peritoneum: gastroduodenal ulcer perforation?",
    "ICD-10 codes": "I21.4, J81.0, J91.8, K27.5, K65.0, k80.2"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Brain",
    "Report": "SCANNER CEREBRAL\n\nIndication\nTraumatisme crânien balistique dans un contexte de tentative d'autolyse par arme à plomb avec orifice d'entrée temporal gauche sans orifice de sortie.\n\nProtocole\nAcquisition sans injection.\n\nRésultats\n\nFracture temporale gauche comminutive avec multiples corps étrangers métalliques millimétriques de part et d'autre.\nContusion hémorragique intraparenchymateuse frontale moyenne gauche en regard de la fracture mesurant environ 2 cm.\nHématome sous-dural de la convexité gauche mesuré jusqu'à 9 mm d'épaisseur.\nHématome extra-axiale frontal supérieur droit de 9 mm d'épaisseur.\nMinime hémorragie intraventriculaire gauche.\n\nEngagement sous-falcoriel avec déviation de la ligne médiane vers la droite de 12 mm.\nDébord temporal interne gauche infracentimétrique.\nPas d'engagement des amygdales cérébelleuses.\nMinime hydrocéphalie d'exclusion avec trop bonne visibilité de la corne temporale droite.\n\n\nConclusion\nFracture temporale gauche comminutive, avec contusion œdématohémorragique adjacente et hématome sous-dural de la convexité, responsable d'un engagement sous-falcoriel et d'un débord temporal interne, avec hydrocéphalie d’exclusion débutante.\n\nIntérêt d'un avis neurochirurgical en urgence. Service demandeur prévenu des constatations.",
    "English translation": "CEREBRAL CT\n\nClinical information\nBallistic cranial trauma in the context of a suicide attempt by pellet gun with an entry wound in the left temporal region and no exit wound.\n\nProtocol\nHelical images without contrast.\n\n\nFindings\n\nComminuted left temporal fracture with multiple millimetric metallic foreign bodies on both sides.\nLeft frontal intraparenchymal hemorrhagic contusion, adjacent to the fracture, measuring 2 cm.\nLeft convexity subdural hematoma measuring up to 9 mm in thickness.\nRight superior frontal extra-axial hematoma measuring 9 mm in thickness.\nMinimal left intraventricular hemorrhage.\n\nSubfalcine herniation with a 12 mm rightward shift of the midline.\nSlight protrusion of the left internal temporal lobe, less than 1 cm.\nNo tonsillar herniation.\nMild obstructive hydrocephalus with increased visibility of the right temporal horn.\n\nImpression\nComminuted left temporal fracture with adjacent cerebral contusion and subdural hematoma, causing subfalcine herniation and internal temporal lobe protrusion, with early obstructive hydrocephalus.\n\nUrgent neurosurgical consultation is recommended. The requesting department has been informed of the findings.",
    "ICD-10 codes": "X72.XXXA, S02.91, S06.31, S06.51, G91.1, S06.A1XA"
  },
  {
    "Language": "Fr",
    "Modality": "RX",
    "DICOM Modality": "Breasts",
    "Report": "MAMMOGRAPHIE BILATERALE\n\nIndication\nDépistage organisé chez une patiente sans antécédent familial, ni de traitement de substitution. Examen clinique sans particularité.\n\nProtocole\nClichés de face et oblique externe.\nDose glandulaire moyenne : 2,6 mGy à droite et 1,9 mGy à gauche.\n\nRésultats\nComparaison à l’examen réalisé il y a 2 ans.\n\nDensité mammaire de type C.\nStabilité de quelques macro et microcalcifications non regroupées en foyer, rondes, régulières, d’allure dystrophiques. \nSur le cliché oblique droit, discrète asymétrie de densité profonde rétroaréolaire d'allure glandulaire, confirmée par un cliché en compression localisée qui retrouve un bon étalement en faveur de tissu fibroglandulaire normal.\nPas d’opacité nodulo-stellaire, de distorsion architecturale ni de foyer de microcalcifications suspect par ailleurs.\n\nConclusion\nExamen classé BI-RADS 2 bilatéral.\n\nProchain bilan sénologique dans deux ans sauf événement clinique intercurrent.",
    "English translation": "BILATERAL MAMMOGRAPHY\n\nClinical information\nOrganized screening in a menopausal woman with no family history or hormone replacement therapy. Clinical examination unremarkable.\n\nComparison : examn performed two years ago.\n\nViews:\nBilateral CC and MLO.\n\nBreast Composition: \nType C (heterogeneously dense which may obscure detection of small masses).\n\n\nFindings\n\nStability of a few scattered macro- and microcalcifications, which are round, regular, and appear dystrophic.\n\nRight breast: \nSlight asymmetry of deep retroareolar density that appears glandular, confirmed by a localized compression view showing good spreading, indicating normal fibroglandular tissue.\nNo evidence of mass, architectural distortion, suspicious microcalcification, skin thickening or nipple retraction.\n\nLeft breast: \nNo evidence of mass, architectural distortion, suspicious micro calcification, skin thickening or nipple retraction.\n\nImpression\nBIRAD 2 benign findings, recommend screening mammogram in two years.",
    "ICD-10 codes": "M92.1, M92.0"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "SCANNER ABDOMINO-PELVIEN\n\n \nINDICATION :\nPatient présentant un syndrome de Down avec altération de l'état général.\nExamen clinique difficile mais possible douleurs abdominales avec syndrome inflammatoire\nbiologique majeur.\n \nPROTOCOLE :\nAcquisition hélicoïdale abdomino-pelvienne sans puis après injection de produit de contraste\nau temps portal.\n \nRESULTAT : examen de qualité sous-optimale en raison d'une acquisition réalisée les bras\nle long du corps.\n \nFoie de taille de morphologie normale.\nPerméabilité des vaisseaux afférent et efférent hépatique.\nPas de dilatation des voies biliaires.\nLithiase vésiculaire déclive sans argument pour une surinfection.\nIntégrité des surrénales, de la rate, du pancréas et des reins.\n \nPas de distension des anses grêles ou du cadre colique.\nPas d'infiltration de la graisse péri-colique et l'épaississement pariétal décelé.\nStase stercorale rectale.\nVessie en forte réplétion avec un calcul d'environ 500 cc.\n \n \nSur les coupes thoraciques basses :\nLame d'épanchement péricardique déclive mesuré au maximum à 7 mm au niveau de la\nparoi libre du VD.\nPas d'épanchement pleural. Pas de foyer de condensation des bases.\n \nSur le plan osseux :\nLyse isthmique bilatérale de L4 à responsable d'un antélisthésis de grade I\n \nCONCLUSION :\nPas de foyer infectieux profond décelée scanographiquement aux étages abdomino-\npelviens.",
    "English translation": "bdominopelvic CT Scan Report\n\nIndication:\nPatient with Down syndrome experiencing general deterioration. Clinical examination is challenging, but possible abdominal pain with significant biological inflammatory syndrome is suspected.\n\nProtocol:\nHelical abdominopelvic acquisition without and then with contrast injection during the portal phase.\n\nFindings:\nThe examination quality is suboptimal due to the arms being positioned alongside the body during acquisition.\nLiver: Normal size and morphology.\nHepatic Vessels: Patent afferent and efferent hepatic vessels.\nBiliary Ducts: No dilation.\nGallbladder: Gravity-dependent gallstones without signs of infection.\nAdrenal Glands, Spleen, Pancreas, and Kidneys: Intact.\n\nIntestines: No distention of the small bowel or colon. No infiltration of pericolic fat and no detected wall thickening.\nRectum: Fecal stasis.\nBladder: Highly distended with a calculus approximately 500 cc.\n\nThoracic Findings (lower slices):\nPericardium: Small pericardial effusion, measuring up to 7 mm at the free wall of the right ventricle.\nPleura: No pleural effusion.\nLung Bases: No consolidation.\n\nBone Findings:\nSpine: Bilateral isthmic lysis of L4, resulting in grade I anterolisthesis.\n\nConclusion:\nNo deep infectious focus detected in the abdominopelvic regions on the scan.",
    "ICD-10 codes": "Q90.9, R10.9, K80.20, I31.39, M43.16"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "SCANNER ABDOMINO-PELVIEN\n\n \nINDICATION :\nSuspicion d'appendicite.\n \nPROTOCOLE :\nAcquisition sans puis après injection.\n \nRESULTAT :\nCollections hydro-aériques plurilobulées en fosse iliaque droite étendue en hypogastre et\npelvien mesuré à 14 x 10 cm en axial.\nBulles de pneumopéritoine cloisonnés en regard de ces collections en rétro-omibilical. Pas\nde pneumopéritoine libre.\n\nCes collections semblent communiquer avec le caecum, en faveur d'une origine\nappendiculaire.\n \nPas d'anomalie significative du caecum ou de la dernière anse.\n \nLithiases vésiculaires sans signe de complication.\nStéatose focale du segment IV hépatique.\nPlusieurs lésions hypodenses spléniques infracentimétriques non caractérisables.\n \nCONCLUSION :\nCollections hydro-aériques plurilobulées de 14cm de grand axe en fosse iliaque droite\nétendue en hypogastre et pelvien, avec bulles de pneumopéritoine cloisonnées en regard,\nen lien en première hypothèse avec une appendicite aigue compliquée d'abcès et de\nperforation.",
    "English translation": "ABDOMINO-PELVIC CT SCAN\n\nINDICATION:\nSuspicion of appendicitis.\n\nPROTOCOL:\nAcquisition without and then after contrast injection.\n\nRESULT:\nMultilobulated fluid and air collections in the right iliac fossa extending to the hypogastric and pelvic regions, measuring 14 x 10 cm in axial view.\nLocalized pneumoperitoneum adjacent to these collections in the retro-umbilical area. No free pneumoperitoneum.\n\nThese collections seem to communicate with the cecum, suggesting an appendiceal origin.\n\nNo significant abnormalities of the cecum or the terminal ileum.\n\nGallstones without signs of complication.\nFocal steatosis of hepatic segment IV.\nSeveral subcentimetric hypodense splenic lesions that are non-characterizable.\n\nCONCLUSION:\nMultilobulated fluid and air collections measuring 14 cm in the longest axis in the right iliac fossa extending to the hypogastric and pelvic regions, with localized pneumoperitoneum adjacent, likely associated with acute complicated appendicitis with abscess and perforation.",
    "ICD-10 codes": "K35.211, K76.0, D73.9"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Thorax",
    "Report": "ANGIOSCANNER THORACIQUE\n\n \nINDICATION :\nDouleurs de l'hypocondre droit, basi-thoracique droite.\nApparition d'une dyspnée dans un contexte de de cardiopathie sur insuffisance mitrale et\ntricuspide.\n \nPROTOCOLE :\nAcquisition hélicoïdale après injection de produit de contraste au temps artériel.\n \nRESULTAT :\nPas d'embolie pulmonaire décelée jusqu'en sous-segmentaire.\nCardiomégalie.\nEpaississement des lignes septales bi-apicales et condensation péri-broncho-vasculaire\nhilaire bilatéral en faveur d'une surcharge vasculaire.\n \nÉpanchement pleural bilatéral de faible abondance associé.\nPlusieurs ganglions médiastino-hilaires hypertrophiés.\nCalcifications coronariennes tritronculaires.\nCalcifications également au sein du VG.\n \nPas de lésion osseuse lytique ou condensante suspecte.\n \nCONCLUSION :\nÉpanchement pleural bilatéral de faible abondance, épaississement des lignes septales bi-\napicales et condensation péri-broncho-vasculaire hilaire bilatéral en faveur d'une surcharge\nvasculaire (OAP).\nPas d'embolie pulmonaire décelée jusqu'en sous-segmentaire",
    "English translation": "THORACIC CT ANGIOGRAPHY\n\nINDICATION:\nRight hypochondrial and right basal thoracic pain. Onset of dyspnea in the context of cardiopathy with mitral and tricuspid insufficiency.\n\nPROTOCOL:\nHelical acquisition after contrast agent injection at the arterial phase.\n\nRESULT:\nNo pulmonary embolism detected up to the subsegmental level.\nCardiomegaly.\nThickening of the bi-apical septal lines and peri-bronchovascular consolidation at the bilateral hilar regions, suggestive of vascular congestion.\n\nLow-volume bilateral pleural effusion observed.\nSeveral enlarged mediastinal-hilar lymph nodes.\nTrivessel coronary calcifications.\nCalcifications also present in the left ventricle.\n\nNo suspicious lytic or sclerotic bone lesions.\n\nCONCLUSION:\nLow-volume bilateral pleural effusion, thickening of the bi-apical septal lines, and peri-bronchovascular consolidation at the bilateral hilar regions, suggestive of vascular congestion (pulmonary edema). No pulmonary embolism detected up to the subsegmental level.",
    "ICD-10 codes": "R10.10, R07.9, R06.00, I34.0, I36.1, I51.7, J81.0, R59.9, J90, I25.84"
  },
  {
    "Language": "Fr",
    "Modality": "CT",
    "DICOM Modality": "Brain",
    "Report": "SCANNER CÉRÉBRAL\n\n \nINDICATION :\nChute. Recherche de saignement intra crânien.\n \nPROTOCOLE :\n\nAcquisition hélicoïdale. Examen réalisé sans injection.\n \nRESULTAT :\nAbsence d’hémorragie intra ou péri-cérébrale.\nAspect normal des structures de la fosse postérieure.\nHypodensités de la substance blanche périventriculaire en faveur dune leucopathie.\nDilatation globale des ventricules cérébraux et des sillons en faveur dune atrophie cortico\nsous corticale.\nAbsence d’anomalie péri-cérébrale.\nPas de fracture.\n \nCONCLUSION :\nAbsence d’hémorragie intra ou péri-cérébrale.",
    "English translation": "BRAIN CT SCAN\n\nINDICATION:\nFall. Investigation for intracranial bleeding.\n\nPROTOCOL:\nHelical acquisition. Examination performed without contrast injection.\n\nRESULT:\nNo intra- or peri-cerebral hemorrhage.\nNormal appearance of the posterior fossa structures.\nPeriventricular white matter hypodensities suggestive of leukoaraiosis.\nGlobal dilation of cerebral ventricles and sulci, suggestive of cortico-subcortical atrophy.\nNo peri-cerebral abnormalities.\nNo fractures.\n\nCONCLUSION:\nNo intra- or peri-cerebral hemorrhage detected.",
    "ICD-10 codes": "I67.9"
  },
  {
    "Language": "Fr",
    "Modality": "US",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "ECHOGRAPHIE ABDOMINO-PELVIENNE\n\n \nINDICATION :\nDouleurs abdominales paroxystiques depuis 3j.\n \nRESULTATS :\nFoie de taille normale, de contours réguliers et d’échostructure homogène.\nPas de lésion focale intra-hépatique décelée.\nBonne perméabilité des veines sus hépatiques et du tronc porte.\nVésicule biliaire de taille normale, à parois fines, à contenu alithiasique.\nAbsence de dilatation des voies biliaires intra ou extra-hépatiques.\n \nPancréas visualisé dans sa portion céphalo-corporéale, d’échostructure homogène.\nRate de taille normale et d’échostructure homogène.\n \nReins symétriques de taille normale, présentant une bonne différenciation parenchymo-\nsinusale, sans dilatation des cavités pyélo-calicielles, sans masse ou calcul décelé.\nVessie en semi réplétion à contenu anéchogène.\n \nLame d'épanchement pelvien.\n \nAppendice non vu. Pas de douleurs au passage de la sonde.\n \nOvaire droit et gauche de taille et de morphologie normales.\n\n \nCONCLUSION :\nLame d'épanchement pelvien.\nAppendice non vu.\nOvaire droit et gauche de taille et de morphologie normales.",
    "English translation": "ABDOMINO-PELVIC ULTRASOUND\n\nINDICATION:\nParoxysmal abdominal pain for 3 days.\n\nRESULTS:\nLiver is of normal size, with regular contours and homogeneous echotexture.\nNo focal intrahepatic lesions detected.\nGood patency of the hepatic veins and the portal vein trunk.\nGallbladder is of normal size, with thin walls and no stones in the content.\nNo dilatation of the intrahepatic or extrahepatic bile ducts.\n\nPancreas visualized in its head and body portions, with homogeneous echotexture.\nSpleen is of normal size and homogeneous echotexture.\n\nKidneys are symmetrical and of normal size, with good parenchymal-sinus differentiation, no dilatation of the pyelocaliceal cavities, and no masses or stones detected.\nBladder is partially filled with anechoic content.\n\nThin layer of pelvic effusion.\n\nAppendix not seen. No pain upon probe passage.\n\nRight and left ovaries are of normal size and morphology.\n\nCONCLUSION:\nThin layer of pelvic effusion.\nAppendix not seen.\nRight and left ovaries are of normal size and morphology.",
    "ICD-10 codes": "R10.9, M25.48"
  },
  {
    "Language": "Fr",
    "Modality": "US",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "ECHOGRAPHIE ABDOMINO-PELVIENNE\n\n \nINDICATION :\nDouleurs épigastriques et vomissements et perturbation du bilan hépatique à type de\ncytolyse.\nAntécédent de cholécystectomie.\n \nRESULTAT :\nFoie de taille limite, aux contours réguliers. Flèche hépatique mesurée à 16 cm.\nParenchyme hépatique d'échogénicité normale, sans lésion focale suspecte.\nPerméabilité du tronc porte et des veines sus-hépatiques.\nStatut post-cholécystectomie.\nTrop bonne visibilité secondaire de la voie biliaire principale, mesurée jusqu'à 10 mm, suivie\njusqu'à la papille sans obstacle décelé.\nPas de dilatation des voies biliaires intrahépatiques.\n \nIntégrité de la tête du corps du pancréas.\nRate de taille normale, homogène.\n \n\nReins de taille normale, avec un diamètre bipolaire de 10 cm à droite comme à gauche.\nPas dilatation des cavités pyélocalicielles.\nVessie en réplétion, à parois fines.\n \nPas d'épanchement intrapéritonéal.\n \nCONCLUSION :\nPas de dilatation des voies biliaires intrahépatiques.",
    "English translation": "ABDOMINO-PELVIC ULTRASOUND\n\nINDICATION:\nEpigastric pain, vomiting, and abnormal liver function tests indicating cytolysis. History of cholecystectomy.\n\nRESULTS:\nLiver is at the upper limit of normal size, with regular contours. Hepatic span measured at 16 cm.\nLiver parenchyma with normal echogenicity, no suspicious focal lesions.\nPatency of the portal vein and hepatic veins.\nPost-cholecystectomy status.\nIncreased visibility of the common bile duct, measured up to 10 mm, followed to the papilla without detected obstruction.\nNo dilatation of intrahepatic bile ducts.\n\nHead and body of the pancreas intact.\nSpleen is normal in size and homogeneous.\n\nKidneys are normal in size, with a bipolar diameter of 10 cm on both sides.\nNo dilatation of the pyelocaliceal cavities.\nBladder is filled, with thin walls.\n\nNo intraperitoneal effusion detected.\n\nCONCLUSION:\nNo dilatation of intrahepatic bile ducts.",
    "ICD-10 codes": "R10.13, Z90.49"
  },
  {
    "Language": "Fr",
    "Modality": "US",
    "DICOM Modality": "Neck",
    "Report": "ECHOGRAPHIE CERVICALE\n\n \nINDICATION :\nBilan d'une tuméfaction sous-mandibulaire droite.\n \nRESULTAT :\nLa tuméfaction palpée correspond à une formation nodulaire sous-mandibulaire droite à contours irréguliers,\nfranchement hypo-échogène, mesurant 27x18 mm, suspecte.\n \nElle apparaît hyperhémiée en mode Doppler.\nPas de microcalcifications.\n \nIl semble exister un liseré graisseux entre cette formation et la glande sous-mandibulaire\ndroite, en faveur d'une origine non salivaire : adénomégalie ?\n \nCompression du canal de Wharton droit et dilatation des canaux salivaires intraglandulaires\nsous-mandibulaires.\n \nPar ailleurs, pas d'autre adénomégalie jugulo-carotidienne ou sous-mandibulaire.\n \nCONCLUSION :\nFormation nodulaire d'allure suspecte sous-mandibulaire droite correspondant\nvraisemblablement à une adénomégalie.\n \nIntérêt d'un avis ORL pour éventuel prélèvement.\n \nMédecin demandeur prévenu.",
    "English translation": "CERVICAL ULTRASOUND\n\nINDICATION:\nEvaluation of a right submandibular mass.\n\nRESULTS:\nThe palpated mass corresponds to a right submandibular nodular formation with irregular contours, markedly hypoechoic, measuring 27x18 mm, and appears suspicious.\n\nIt shows increased blood flow on Doppler mode.\nNo microcalcifications are observed.\n\nA fatty plane seems to exist between this formation and the right submandibular gland, suggesting a non-salivary origin: possibly lymphadenopathy?\n\nCompression of the right Wharton's duct and dilation of the intraglandular submandibular salivary ducts are noted.\n\nNo other jugulo-carotid or submandibular lymphadenopathy observed.\n\nCONCLUSION:\nSuspicious-appearing nodular formation in the right submandibular region likely corresponding to lymphadenopathy.\n\nRecommendation for an ENT specialist consultation for a possible biopsy.\n\nThe referring physician has been notified.",
    "ICD-10 codes": "R22.1"
  },
  {
    "Language": "Fr",
    "Modality": "US",
    "DICOM Modality": "Neck",
    "Report": "ECHOGRAPHIE DE LA THYROÏDE\n\n \nINDICATION :\nBilan d'une hypothyroïdie survenue au cours d'un traitement par immunothérapie pour CHC.\n \nRESULTAT :\nIsthme mesuré à 2 mm.\nLobe droit mesuré à 46x21x19 mm, soit un volume de 9,6 cc.\nLobe gauche mesuré à 36x17x14 mm, soit un volume de 4,6 cc.\n \nParenchyme thyroïdien hétérogène, globalement hypo-échogène, avec perte du gradient\nmusculo-parenchymateux.\n \nPas d'hyperhémie en mode Doppler.\n \nPas de nodule.\n\n \nPas d'adénomégalie jugulo-carotidienne ou sous-mandibulaire.\n \nCONCLUSION :\nPas de goitre.\nPas de nodule thyroïdien suspect.\nAspect compatible avec des séquelles de thyroïdite.",
    "English translation": "THYROID ULTRASOUND\n\nINDICATION:\nEvaluation of hypothyroidism during immunotherapy treatment for hepatocellular carcinoma (HCC).\n\nRESULTS:\nIsthmus measured at 2 mm.\nRight lobe measured at 46x21x19 mm, with a volume of 9.6 cc.\nLeft lobe measured at 36x17x14 mm, with a volume of 4.6 cc.\n\nThyroid parenchyma is heterogeneous, overall hypoechoic, with loss of the muscle-parenchymal gradient.\n\nNo hyperemia observed on Doppler mode.\n\nNo nodules detected.\n\nNo jugulo-carotid or submandibular lymphadenopathy observed.\n\nCONCLUSION:\nNo goiter.\nNo suspicious thyroid nodules.\nFindings are compatible with sequelae of thyroiditis.",
    "ICD-10 codes": "E06.9"
  },
  {
    "Language": "Fr",
    "Modality": "US",
    "DICOM Modality": "Abdomen Pelvis",
    "Report": "ECHOGRAPHIE ABDOMINO-PELVIENNE\n\n \nINDICATION :\nDouleurs en fosse iliaque gauche irradiantes vers la région pelvienne, résolues.\n \nRESULTAT :\nFoie homogène de taille normale et de contours réguliers, sans lésion focale décelée.\nStatut post cholécystectomie. Pas de dilatation des voies biliaires intra et extrahépatiques.\nRétropéritoine non dégagé de part l'interposition des gaz digestifs.\nLes reins sont de morphologie normale. Les cavités excrétrices ne sont pas dilatées.\nRate homogène, de taille normale.\nPas de liquide libre intra-abdominal.\n \nVessie en réplétion partielle durant l'examen, de contenu anéchogène.\nUtérus de taille normale.\nOvaires de taille de morphologie normale. Formation kystique annexielle gauche de 35 mm.\nCul-de-sac de Douglas libre.\n \nCONCLUSION :\nPas de dilatation des cavités excrétrices.\nFormation kystique annexielle gauche de 35 mm. Intérêt d'un avis gynécologique et\nd'un contrôle échographique dans 3 mois.",
    "English translation": "ABDOMINO-PELVIC ULTRASOUND\n\nINDICATION:\nPain in the left iliac fossa radiating to the pelvic region, resolved.\n\nRESULTS:\nLiver is homogeneous, of normal size and regular contours, with no focal lesions detected.\nPost-cholecystectomy status. No dilatation of intrahepatic and extrahepatic bile ducts.\nRetroperitoneum not visualized due to interposition of digestive gases.\nKidneys have a normal morphology. Excretory cavities are not dilated.\nSpleen is homogeneous and of normal size.\nNo free intra-abdominal fluid.\n\nBladder is partially filled during the examination, with anechoic content.\nUterus is of normal size.\nOvaries are of normal size and morphology. A left adnexal cystic formation measuring 35 mm is noted.\nCul-de-sac of Douglas is free.\n\nCONCLUSION:\nNo dilatation of the excretory cavities.\nLeft adnexal cystic formation of 35 mm. A gynecological consultation and follow-up ultrasound in 3 months are recommended.",
    "ICD-10 codes": "M54.59, Z90.49, N83.201"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Foot",
    "Report": "IRM DU PIED GAUCHE\n\n \nINDICATION :\nSuspicion d'ostéite du pied sur plaie du 4ème espace intercapito-métatarsien.\n \nPROTOCOLE :\nSéquences axiales et sagittales T1, DP Dixon et T1 Dixon après injection de gadolinium.\n \nRESULTAT :\nHypersignal T1, discret hypersignal T2 avec prise de contraste ostéomédullaire de la\nphalange proximale du 4ème rayon.\nDiscrète anomalie de signal également de la tête du 4ème métatarsien en regard.\nCes anomalies de signal sont situés en regard de l'appui et décrite.\n \nPas d'épanchement intra-articulaire significatif.\nPas d'autre anomalie de signal ostéo-médullaire.\n \nCONCLUSION :\nAspect IRM compatible avec une ostéite de la phalange proximale du 4ème rayon.",
    "English translation": "MRI OF THE LEFT FOOT\n\nINDICATION:\nSuspicion of osteitis of the foot related to a wound in the 4th intercapitometatarsal space.\n\nPROTOCOL:\nAxial and sagittal sequences T1, DP Dixon, and T1 Dixon after gadolinium injection.\n\nRESULTS:\nHyperintense signal on T1, slight hyperintense signal on T2 with osteomedullary contrast enhancement of the proximal phalanx of the 4th ray.\nSlight signal anomaly also noted at the head of the 4th metatarsal in the corresponding area.\nThese signal anomalies are located at the site of pressure and described as such.\n\nNo significant intra-articular effusion.\nNo other osteomedullary signal anomalies.\n\nCONCLUSION:\nMRI findings compatible with osteitis of the proximal phalanx of the 4th ray.",
    "ICD-10 codes": "M86.8X7"
  },
  {
    "Language": "Fr",
    "Modality": "MR",
    "DICOM Modality": "Spine",
    "Report": "IRM DU RACHIS CERVICAL\n\n \nINDICATION :\nBilan de névralgie cervico-brachiale droite.\n \nPROTOCOLE :\nSéquences sagittale T1, T2 STIR et 3D T2.\n \nRESULTAT :\nRespect de hauteur et de lalignement des corps vertébraux.\nPas danomalie décelée de la charnière cervico-occipitale.\nCanal cervical légèrement étroit de façon constitutionnelle.\nPas de lésion de remplacement médullaire suspecte.\n \nAbsence de rétrécissement canalaire secondaire significatif.\nRemaniements unco-discarthrosiques débutants en C3-C4, C4-C5, C5-C6 responsables de\nrétrécissements foraminaux gauches modérés.\nAbsence de rétrécissement foraminal droit significatif.\n \nCONCLUSION :\nAbsence de rétrécissement foraminal ou canalaire significatif notamment à droite.\nPas de conflit disco-radiculaire.",
    "English translation": "CERVICAL SPINE MRI\n\nINDICATION:\nEvaluation of right cervicobrachial neuralgia.\n\nPROTOCOL:\nSagittal sequences T1, T2 STIR, and 3D T2.\n\nRESULTS:\nPreservation of height and alignment of the vertebral bodies.\nNo abnormalities detected at the cervico-occipital junction.\nSlightly narrow cervical canal constitutionally.\nNo suspicious medullary replacement lesions.\n\nNo significant secondary canal stenosis.\nEarly uncovertebral and disc arthrosis changes at C3-C4, C4-C5, and C5-C6 responsible for moderate left foraminal narrowing.\nNo significant right foraminal narrowing.\n\nCONCLUSION:\nNo significant foraminal or canal stenosis, particularly on the right.\nNo disc-radicular conflict.",
    "ICD-10 codes": "M47.812, M53.1"
  }
]
